# Comparing `tmp/fastcons-0.3.0-cp311-cp311-musllinux_1_1_x86_64.whl.zip` & `tmp/fastcons-0.4.0-cp311-cp311-musllinux_1_1_x86_64.whl.zip`

## zipinfo {}

```diff
@@ -1,10 +1,10 @@
-Zip file size: 30593 bytes, number of entries: 8
-drwxr-xr-x  2.0 unx        0 b- stor 23-Apr-20 20:32 fastcons-0.3.0.dist-info/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Apr-20 20:32 fastcons.libs/
--rwxr-xr-x  2.0 unx    73168 b- defN 23-Apr-20 20:32 fastcons.cpython-311-x86_64-linux-musl.so
--rw-r--r--  2.0 unx      113 b- defN 23-Apr-20 20:32 fastcons-0.3.0.dist-info/WHEEL
--rw-r--r--  2.0 unx       20 b- defN 23-Apr-20 20:32 fastcons-0.3.0.dist-info/top_level.txt
--rw-r--r--  2.0 unx     1069 b- defN 23-Apr-20 20:32 fastcons-0.3.0.dist-info/LICENSE.txt
--rw-rw-r--  2.0 unx      501 b- defN 23-Apr-20 20:32 fastcons-0.3.0.dist-info/RECORD
--rw-r--r--  2.0 unx     2619 b- defN 23-Apr-20 20:32 fastcons-0.3.0.dist-info/METADATA
-8 files, 77490 bytes uncompressed, 29467 bytes compressed:  62.0%
+Zip file size: 37819 bytes, number of entries: 8
+drwxr-xr-x  2.0 unx        0 b- stor 23-May-02 20:50 fastcons-0.4.0.dist-info/
+drwxr-xr-x  2.0 unx        0 b- stor 23-May-02 20:50 fastcons.libs/
+-rwxr-xr-x  2.0 unx    92184 b- defN 23-May-02 20:50 fastcons.cpython-311-x86_64-linux-musl.so
+-rw-r--r--  2.0 unx     3877 b- defN 23-May-02 20:50 fastcons-0.4.0.dist-info/METADATA
+-rw-r--r--  2.0 unx     1069 b- defN 23-May-02 20:50 fastcons-0.4.0.dist-info/LICENSE.txt

     <188>   DW_AT_type        : (ref4) <0x180>, unsigned char
  <1><18c>: Abbrev Number: 4 (DW_TAG_base_type)
     <18d>   DW_AT_byte_size   : (data1) 2
     <18e>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <18f>   DW_AT_name        : (strp) (offset: 0x226c): short unsigned int
+    <18f>   DW_AT_name        : (strp) (offset: 0x23a4): short unsigned int
  <1><193>: Abbrev Number: 3 (DW_TAG_typedef)
-    <194>   DW_AT_name        : (strp) (offset: 0x219f): uint32_t
+    <194>   DW_AT_name        : (strp) (offset: 0x22c3): uint32_t
     <198>   DW_AT_decl_file   : (data1) 5
     <199>   DW_AT_decl_line   : (data1) 172
     <19a>   DW_AT_decl_column : (data1) 25
     <19b>   DW_AT_type        : (ref4) <0x7c>, unsigned int
  <1><19f>: Abbrev Number: 3 (DW_TAG_typedef)
-    <1a0>   DW_AT_name        : (strp) (offset: 0x1e4b): uint64_t
+    <1a0>   DW_AT_name        : (strp) (offset: 0x1f6f): uint64_t
     <1a4>   DW_AT_decl_file   : (data1) 5
     <1a5>   DW_AT_decl_line   : (data1) 177
     <1a6>   DW_AT_decl_column : (data1) 25
     <1a7>   DW_AT_type        : (ref4) <0x62>, long unsigned int
  <1><1ab>: Abbrev Number: 3 (DW_TAG_typedef)
-    <1ac>   DW_AT_name        : (strp) (offset: 0x19ad): Py_ssize_t
+    <1ac>   DW_AT_name        : (strp) (offset: 0x1aa1): Py_ssize_t
     <1b0>   DW_AT_decl_file   : (data1) 9
     <1b1>   DW_AT_decl_line   : (data1) 131
     <1b2>   DW_AT_decl_column : (data1) 25
     <1b3>   DW_AT_type        : (ref4) <0x8a>, ssize_t, long int
  <1><1b7>: Abbrev Number: 3 (DW_TAG_typedef)
-    <1b8>   DW_AT_name        : (strp) (offset: 0x58e): Py_hash_t
+    <1b8>   DW_AT_name        : (strp) (offset: 0x5e8): Py_hash_t
     <1bc>   DW_AT_decl_file   : (data1) 9
     <1bd>   DW_AT_decl_line   : (data1) 145
     <1be>   DW_AT_decl_column : (data1) 20
     <1bf>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
  <1><1c3>: Abbrev Number: 3 (DW_TAG_typedef)
-    <1c4>   DW_AT_name        : (strp) (offset: 0x1bc): Py_uhash_t
+    <1c4>   DW_AT_name        : (strp) (offset: 0x1c3): Py_uhash_t
     <1c8>   DW_AT_decl_file   : (data1) 9
     <1c9>   DW_AT_decl_line   : (data1) 148
     <1ca>   DW_AT_decl_column : (data1) 16
     <1cb>   DW_AT_type        : (ref4) <0x56>, size_t, long unsigned int
  <1><1cf>: Abbrev Number: 4 (DW_TAG_base_type)
     <1d0>   DW_AT_byte_size   : (data1) 4
     <1d1>   DW_AT_encoding    : (data1) 4	(float)
-    <1d2>   DW_AT_name        : (strp) (offset: 0x882): float
+    <1d2>   DW_AT_name        : (strp) (offset: 0x959): float
  <1><1d6>: Abbrev Number: 11 (DW_TAG_variable)
-    <1d7>   DW_AT_name        : (strp) (offset: 0x199e): signgam
+    <1d7>   DW_AT_name        : (strp) (offset: 0x1a92): signgam
     <1db>   DW_AT_decl_file   : (data1) 10
     <1dc>   DW_AT_decl_line   : (data2) 384
     <1de>   DW_AT_decl_column : (data1) 12
     <1df>   DW_AT_type        : (ref4) <0x4f>, int
     <1e3>   DW_AT_external    : (flag_present) 1
     <1e3>   DW_AT_declaration : (flag_present) 1
  <1><1e3>: Abbrev Number: 12 (DW_TAG_array_type)
     <1e4>   DW_AT_type        : (ref4) <0xea>, char
     <1e8>   DW_AT_sibling     : (ref4) <0x1f3>
  <2><1ec>: Abbrev Number: 13 (DW_TAG_subrange_type)
     <1ed>   DW_AT_type        : (ref4) <0x62>, long unsigned int
     <1f1>   DW_AT_upper_bound : (data1) 1
  <2><1f2>: Abbrev Number: 0
  <1><1f3>: Abbrev Number: 9 (DW_TAG_variable)
-    <1f4>   DW_AT_name        : (strp) (offset: 0x1591): tzname
+    <1f4>   DW_AT_name        : (strp) (offset: 0x166b): tzname
     <1f8>   DW_AT_decl_file   : (data1) 11
     <1f9>   DW_AT_decl_line   : (data1) 114
     <1fa>   DW_AT_decl_column : (data1) 14
     <1fb>   DW_AT_type        : (ref4) <0x1e3>, char
     <1ff>   DW_AT_external    : (flag_present) 1
     <1ff>   DW_AT_declaration : (flag_present) 1
  <1><1ff>: Abbrev Number: 9 (DW_TAG_variable)
-    <200>   DW_AT_name        : (strp) (offset: 0x23af): daylight
+    <200>   DW_AT_name        : (strp) (offset: 0x24e7): daylight
     <204>   DW_AT_decl_file   : (data1) 11
     <205>   DW_AT_decl_line   : (data1) 121
     <206>   DW_AT_decl_column : (data1) 12
     <207>   DW_AT_type        : (ref4) <0x4f>, int
     <20b>   DW_AT_external    : (flag_present) 1
     <20b>   DW_AT_declaration : (flag_present) 1
  <1><20b>: Abbrev Number: 9 (DW_TAG_variable)
-    <20c>   DW_AT_name        : (strp) (offset: 0xa5e): timezone
+    <20c>   DW_AT_name        : (strp) (offset: 0xb3e): timezone
     <210>   DW_AT_decl_file   : (data1) 11
     <211>   DW_AT_decl_line   : (data1) 122
     <212>   DW_AT_decl_column : (data1) 13
     <213>   DW_AT_type        : (ref4) <0x6e>, long int
     <217>   DW_AT_external    : (flag_present) 1
     <217>   DW_AT_declaration : (flag_present) 1
  <1><217>: Abbrev Number: 9 (DW_TAG_variable)
-    <218>   DW_AT_name        : (strp) (offset: 0x2172): getdate_err
+    <218>   DW_AT_name        : (strp) (offset: 0x2296): getdate_err
     <21c>   DW_AT_decl_file   : (data1) 11
     <21d>   DW_AT_decl_line   : (data1) 123
     <21e>   DW_AT_decl_column : (data1) 12
     <21f>   DW_AT_type        : (ref4) <0x4f>, int
     <223>   DW_AT_external    : (flag_present) 1
     <223>   DW_AT_declaration : (flag_present) 1
  <1><223>: Abbrev Number: 14 (DW_TAG_structure_type)
-    <224>   DW_AT_name        : (strp) (offset: 0x128b): PyModuleDef
+    <224>   DW_AT_name        : (strp) (offset: 0x135c): PyModuleDef
     <228>   DW_AT_byte_size   : (data1) 104
     <229>   DW_AT_decl_file   : (data1) 12
     <22a>   DW_AT_decl_line   : (data1) 74
     <22b>   DW_AT_decl_column : (data1) 8
     <22c>   DW_AT_sibling     : (ref4) <0x2a6>
  <2><230>: Abbrev Number: 15 (DW_TAG_member)
-    <231>   DW_AT_name        : (strp) (offset: 0x22d5): m_base
+    <231>   DW_AT_name        : (strp) (offset: 0x240d): m_base
     <235>   DW_AT_decl_file   : (data1) 12
     <236>   DW_AT_decl_line   : (data1) 75
     <237>   DW_AT_decl_column : (data1) 20
     <238>   DW_AT_type        : (ref4) <0x1a44>, PyModuleDef_Base, PyModuleDef_Base
     <23c>   DW_AT_data_member_location: (data1) 0
  <2><23d>: Abbrev Number: 15 (DW_TAG_member)
-    <23e>   DW_AT_name        : (strp) (offset: 0x1d91): m_name
+    <23e>   DW_AT_name        : (strp) (offset: 0x1ea2): m_name
     <242>   DW_AT_decl_file   : (data1) 12
     <243>   DW_AT_decl_line   : (data1) 76
     <244>   DW_AT_decl_column : (data1) 15
     <245>   DW_AT_type        : (ref4) <0xf0>, char
     <249>   DW_AT_data_member_location: (data1) 40
  <2><24a>: Abbrev Number: 15 (DW_TAG_member)
-    <24b>   DW_AT_name        : (strp) (offset: 0x139f): m_doc
+    <24b>   DW_AT_name        : (strp) (offset: 0x1470): m_doc
     <24f>   DW_AT_decl_file   : (data1) 12
     <250>   DW_AT_decl_line   : (data1) 77
     <251>   DW_AT_decl_column : (data1) 15
     <252>   DW_AT_type        : (ref4) <0xf0>, char
     <256>   DW_AT_data_member_location: (data1) 48
  <2><257>: Abbrev Number: 15 (DW_TAG_member)
-    <258>   DW_AT_name        : (strp) (offset: 0xd0a): m_size
+    <258>   DW_AT_name        : (strp) (offset: 0xdc5): m_size
     <25c>   DW_AT_decl_file   : (data1) 12
     <25d>   DW_AT_decl_line   : (data1) 78
     <25e>   DW_AT_decl_column : (data1) 14
     <25f>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
     <263>   DW_AT_data_member_location: (data1) 56
  <2><264>: Abbrev Number: 15 (DW_TAG_member)
-    <265>   DW_AT_name        : (strp) (offset: 0x2420): m_methods
+    <265>   DW_AT_name        : (strp) (offset: 0x2558): m_methods
     <269>   DW_AT_decl_file   : (data1) 12
     <26a>   DW_AT_decl_line   : (data1) 79
     <26b>   DW_AT_decl_column : (data1) 16
     <26c>   DW_AT_type        : (ref4) <0x13fb>, PyMethodDef, PyMethodDef
     <270>   DW_AT_data_member_location: (data1) 64
  <2><271>: Abbrev Number: 15 (DW_TAG_member)
-    <272>   DW_AT_name        : (strp) (offset: 0x17df): m_slots
+    <272>   DW_AT_name        : (strp) (offset: 0x18a8): m_slots
     <276>   DW_AT_decl_file   : (data1) 12
     <277>   DW_AT_decl_line   : (data1) 80
     <278>   DW_AT_decl_column : (data1) 21
     <279>   DW_AT_type        : (ref4) <0x1a50>, PyModuleDef_Slot, PyModuleDef_Slot
     <27d>   DW_AT_data_member_location: (data1) 72
  <2><27e>: Abbrev Number: 15 (DW_TAG_member)
-    <27f>   DW_AT_name        : (strp) (offset: 0x1884): m_traverse
+    <27f>   DW_AT_name        : (strp) (offset: 0x1962): m_traverse
     <283>   DW_AT_decl_file   : (data1) 12
     <284>   DW_AT_decl_line   : (data1) 81
     <285>   DW_AT_decl_column : (data1) 16
     <286>   DW_AT_type        : (ref4) <0xd35>, traverseproc, int
     <28a>   DW_AT_data_member_location: (data1) 80
  <2><28b>: Abbrev Number: 15 (DW_TAG_member)
-    <28c>   DW_AT_name        : (strp) (offset: 0x11ab): m_clear
+    <28c>   DW_AT_name        : (strp) (offset: 0x127c): m_clear
     <290>   DW_AT_decl_file   : (data1) 12
     <291>   DW_AT_decl_line   : (data1) 82
     <292>   DW_AT_decl_column : (data1) 11
     <293>   DW_AT_type        : (ref4) <0xc2b>, inquiry, int
     <297>   DW_AT_data_member_location: (data1) 88
  <2><298>: Abbrev Number: 15 (DW_TAG_member)
-    <299>   DW_AT_name        : (strp) (offset: 0x2233): m_free
+    <299>   DW_AT_name        : (strp) (offset: 0x2357): m_free
     <29d>   DW_AT_decl_file   : (data1) 12
     <29e>   DW_AT_decl_line   : (data1) 83
     <29f>   DW_AT_decl_column : (data1) 12
     <2a0>   DW_AT_type        : (ref4) <0xd60>, freefunc
     <2a4>   DW_AT_data_member_location: (data1) 96
  <2><2a5>: Abbrev Number: 0
  <1><2a6>: Abbrev Number: 3 (DW_TAG_typedef)
-    <2a7>   DW_AT_name        : (strp) (offset: 0x13e0): PyModuleDef_Slot
+    <2a7>   DW_AT_name        : (strp) (offset: 0x14a2): PyModuleDef_Slot
     <2ab>   DW_AT_decl_file   : (data1) 13
     <2ac>   DW_AT_decl_line   : (data1) 13
     <2ad>   DW_AT_decl_column : (data1) 33
     <2ae>   DW_AT_type        : (ref4) <0x2b2>, PyModuleDef_Slot
  <1><2b2>: Abbrev Number: 14 (DW_TAG_structure_type)
-    <2b3>   DW_AT_name        : (strp) (offset: 0x13e0): PyModuleDef_Slot
+    <2b3>   DW_AT_name        : (strp) (offset: 0x14a2): PyModuleDef_Slot
     <2b7>   DW_AT_byte_size   : (data1) 16
     <2b8>   DW_AT_decl_file   : (data1) 12
     <2b9>   DW_AT_decl_line   : (data1) 60
     <2ba>   DW_AT_decl_column : (data1) 8
     <2bb>   DW_AT_sibling     : (ref4) <0x2da>
  <2><2bf>: Abbrev Number: 15 (DW_TAG_member)
-    <2c0>   DW_AT_name        : (strp) (offset: 0x22d0): slot
+    <2c0>   DW_AT_name        : (strp) (offset: 0x2408): slot
     <2c4>   DW_AT_decl_file   : (data1) 12
     <2c5>   DW_AT_decl_line   : (data1) 61
     <2c6>   DW_AT_decl_column : (data1) 9
     <2c7>   DW_AT_type        : (ref4) <0x4f>, int
     <2cb>   DW_AT_data_member_location: (data1) 0
  <2><2cc>: Abbrev Number: 15 (DW_TAG_member)
-    <2cd>   DW_AT_name        : (strp) (offset: 0xb19): value
+    <2cd>   DW_AT_name        : (strp) (offset: 0xbf9): value
     <2d1>   DW_AT_decl_file   : (data1) 12
     <2d2>   DW_AT_decl_line   : (data1) 62
     <2d3>   DW_AT_decl_column : (data1) 11
     <2d4>   DW_AT_type        : (ref4) <0x88>
     <2d8>   DW_AT_data_member_location: (data1) 8
  <2><2d9>: Abbrev Number: 0
  <1><2da>: Abbrev Number: 3 (DW_TAG_typedef)
-    <2db>   DW_AT_name        : (strp) (offset: 0x188f): PyMethodDef
+    <2db>   DW_AT_name        : (strp) (offset: 0x196d): PyMethodDef
     <2df>   DW_AT_decl_file   : (data1) 13
     <2e0>   DW_AT_decl_line   : (data1) 14
     <2e1>   DW_AT_decl_column : (data1) 28
     <2e2>   DW_AT_type        : (ref4) <0x2e6>, PyMethodDef
  <1><2e6>: Abbrev Number: 14 (DW_TAG_structure_type)
-    <2e7>   DW_AT_name        : (strp) (offset: 0x188f): PyMethodDef
+    <2e7>   DW_AT_name        : (strp) (offset: 0x196d): PyMethodDef
     <2eb>   DW_AT_byte_size   : (data1) 32
     <2ec>   DW_AT_decl_file   : (data1) 14
     <2ed>   DW_AT_decl_line   : (data1) 54
     <2ee>   DW_AT_decl_column : (data1) 8
     <2ef>   DW_AT_sibling     : (ref4) <0x328>
  <2><2f3>: Abbrev Number: 15 (DW_TAG_member)
-    <2f4>   DW_AT_name        : (strp) (offset: 0x24be): ml_name
+    <2f4>   DW_AT_name        : (strp) (offset: 0x2600): ml_name
     <2f8>   DW_AT_decl_file   : (data1) 14
     <2f9>   DW_AT_decl_line   : (data1) 55
     <2fa>   DW_AT_decl_column : (data1) 18
     <2fb>   DW_AT_type        : (ref4) <0xf0>, char
     <2ff>   DW_AT_data_member_location: (data1) 0
  <2><300>: Abbrev Number: 15 (DW_TAG_member)
-    <301>   DW_AT_name        : (strp) (offset: 0x13c9): ml_meth
+    <301>   DW_AT_name        : (strp) (offset: 0x148b): ml_meth
     <305>   DW_AT_decl_file   : (data1) 14
     <306>   DW_AT_decl_line   : (data1) 56
     <307>   DW_AT_decl_column : (data1) 17
     <308>   DW_AT_type        : (ref4) <0x19c7>, PyCFunction, PyObject, _object
     <30c>   DW_AT_data_member_location: (data1) 8
  <2><30d>: Abbrev Number: 15 (DW_TAG_member)
-    <30e>   DW_AT_name        : (strp) (offset: 0x1233): ml_flags
+    <30e>   DW_AT_name        : (strp) (offset: 0x1304): ml_flags
     <312>   DW_AT_decl_file   : (data1) 14
     <313>   DW_AT_decl_line   : (data1) 57
     <314>   DW_AT_decl_column : (data1) 17
     <315>   DW_AT_type        : (ref4) <0x4f>, int
     <319>   DW_AT_data_member_location: (data1) 16
  <2><31a>: Abbrev Number: 15 (DW_TAG_member)
-    <31b>   DW_AT_name        : (strp) (offset: 0x20d2): ml_doc
+    <31b>   DW_AT_name        : (strp) (offset: 0x21f6): ml_doc
     <31f>   DW_AT_decl_file   : (data1) 14
     <320>   DW_AT_decl_line   : (data1) 59
     <321>   DW_AT_decl_column : (data1) 18
     <322>   DW_AT_type        : (ref4) <0xf0>, char
     <326>   DW_AT_data_member_location: (data1) 24
  <2><327>: Abbrev Number: 0
  <1><328>: Abbrev Number: 3 (DW_TAG_typedef)
-    <329>   DW_AT_name        : (strp) (offset: 0x1c60): PyGetSetDef
+    <329>   DW_AT_name        : (strp) (offset: 0x1d54): PyGetSetDef
     <32d>   DW_AT_decl_file   : (data1) 13
     <32e>   DW_AT_decl_line   : (data1) 15
     <32f>   DW_AT_decl_column : (data1) 28
     <330>   DW_AT_type        : (ref4) <0x334>, PyGetSetDef
  <1><334>: Abbrev Number: 14 (DW_TAG_structure_type)
-    <335>   DW_AT_name        : (strp) (offset: 0x1c60): PyGetSetDef
+    <335>   DW_AT_name        : (strp) (offset: 0x1d54): PyGetSetDef
     <339>   DW_AT_byte_size   : (data1) 40
     <33a>   DW_AT_decl_file   : (data1) 15
     <33b>   DW_AT_decl_line   : (data1) 11
     <33c>   DW_AT_decl_column : (data1) 8
     <33d>   DW_AT_sibling     : (ref4) <0x383>
  <2><341>: Abbrev Number: 15 (DW_TAG_member)
-    <342>   DW_AT_name        : (strp) (offset: 0x24c1): name
+    <342>   DW_AT_name        : (strp) (offset: 0x2603): name
     <346>   DW_AT_decl_file   : (data1) 15
     <347>   DW_AT_decl_line   : (data1) 12
     <348>   DW_AT_decl_column : (data1) 17
     <349>   DW_AT_type        : (ref4) <0xf0>, char
     <34d>   DW_AT_data_member_location: (data1) 0
  <2><34e>: Abbrev Number: 16 (DW_TAG_member)
     <34f>   DW_AT_name        : (string) get
@@ -472,997 +472,997 @@
     <369>   DW_AT_name        : (string) doc
     <36d>   DW_AT_decl_file   : (data1) 15
     <36e>   DW_AT_decl_line   : (data1) 15
     <36f>   DW_AT_decl_column : (data1) 17
     <370>   DW_AT_type        : (ref4) <0xf0>, char
     <374>   DW_AT_data_member_location: (data1) 24
  <2><375>: Abbrev Number: 15 (DW_TAG_member)
-    <376>   DW_AT_name        : (strp) (offset: 0xefe): closure
+    <376>   DW_AT_name        : (strp) (offset: 0xfc5): closure
     <37a>   DW_AT_decl_file   : (data1) 15
     <37b>   DW_AT_decl_line   : (data1) 16
     <37c>   DW_AT_decl_column : (data1) 11
     <37d>   DW_AT_type        : (ref4) <0x88>
     <381>   DW_AT_data_member_location: (data1) 32
  <2><382>: Abbrev Number: 0
  <1><383>: Abbrev Number: 3 (DW_TAG_typedef)
-    <384>   DW_AT_name        : (strp) (offset: 0x950): PyMemberDef
+    <384>   DW_AT_name        : (strp) (offset: 0xa30): PyMemberDef
     <388>   DW_AT_decl_file   : (data1) 13
     <389>   DW_AT_decl_line   : (data1) 16
     <38a>   DW_AT_decl_column : (data1) 28
     <38b>   DW_AT_type        : (ref4) <0x38f>, PyMemberDef
  <1><38f>: Abbrev Number: 14 (DW_TAG_structure_type)
-    <390>   DW_AT_name        : (strp) (offset: 0x950): PyMemberDef
+    <390>   DW_AT_name        : (strp) (offset: 0xa30): PyMemberDef
     <394>   DW_AT_byte_size   : (data1) 40
     <395>   DW_AT_decl_file   : (data1) 16
     <396>   DW_AT_decl_line   : (data1) 18
     <397>   DW_AT_decl_column : (data1) 8
     <398>   DW_AT_sibling     : (ref4) <0x3de>
  <2><39c>: Abbrev Number: 15 (DW_TAG_member)
-    <39d>   DW_AT_name        : (strp) (offset: 0x24c1): name
+    <39d>   DW_AT_name        : (strp) (offset: 0x2603): name
     <3a1>   DW_AT_decl_file   : (data1) 16
     <3a2>   DW_AT_decl_line   : (data1) 19
     <3a3>   DW_AT_decl_column : (data1) 17
     <3a4>   DW_AT_type        : (ref4) <0xf0>, char
     <3a8>   DW_AT_data_member_location: (data1) 0
  <2><3a9>: Abbrev Number: 15 (DW_TAG_member)
-    <3aa>   DW_AT_name        : (strp) (offset: 0x222e): type
+    <3aa>   DW_AT_name        : (strp) (offset: 0x2352): type
     <3ae>   DW_AT_decl_file   : (data1) 16
     <3af>   DW_AT_decl_line   : (data1) 20
     <3b0>   DW_AT_decl_column : (data1) 9
     <3b1>   DW_AT_type        : (ref4) <0x4f>, int
     <3b5>   DW_AT_data_member_location: (data1) 8
  <2><3b6>: Abbrev Number: 15 (DW_TAG_member)
-    <3b7>   DW_AT_name        : (strp) (offset: 0x912): offset
+    <3b7>   DW_AT_name        : (strp) (offset: 0x9f2): offset
     <3bb>   DW_AT_decl_file   : (data1) 16
     <3bc>   DW_AT_decl_line   : (data1) 21
     <3bd>   DW_AT_decl_column : (data1) 16
     <3be>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
     <3c2>   DW_AT_data_member_location: (data1) 16
  <2><3c3>: Abbrev Number: 15 (DW_TAG_member)
-    <3c4>   DW_AT_name        : (strp) (offset: 0x1236): flags
+    <3c4>   DW_AT_name        : (strp) (offset: 0x1307): flags
     <3c8>   DW_AT_decl_file   : (data1) 16
     <3c9>   DW_AT_decl_line   : (data1) 22
     <3ca>   DW_AT_decl_column : (data1) 9
     <3cb>   DW_AT_type        : (ref4) <0x4f>, int
     <3cf>   DW_AT_data_member_location: (data1) 24
  <2><3d0>: Abbrev Number: 16 (DW_TAG_member)
     <3d1>   DW_AT_name        : (string) doc
     <3d5>   DW_AT_decl_file   : (data1) 16
     <3d6>   DW_AT_decl_line   : (data1) 23
     <3d7>   DW_AT_decl_column : (data1) 17
     <3d8>   DW_AT_type        : (ref4) <0xf0>, char
     <3dc>   DW_AT_data_member_location: (data1) 32
  <2><3dd>: Abbrev Number: 0
  <1><3de>: Abbrev Number: 3 (DW_TAG_typedef)
-    <3df>   DW_AT_name        : (strp) (offset: 0x1406): PyObject
+    <3df>   DW_AT_name        : (strp) (offset: 0x14c8): PyObject
     <3e3>   DW_AT_decl_file   : (data1) 13
     <3e4>   DW_AT_decl_line   : (data1) 18
     <3e5>   DW_AT_decl_column : (data1) 24
     <3e6>   DW_AT_type        : (ref4) <0x3ea>, _object
  <1><3ea>: Abbrev Number: 14 (DW_TAG_structure_type)
-    <3eb>   DW_AT_name        : (strp) (offset: 0x51b): _object
+    <3eb>   DW_AT_name        : (strp) (offset: 0x575): _object
     <3ef>   DW_AT_byte_size   : (data1) 16
     <3f0>   DW_AT_decl_file   : (data1) 2
     <3f1>   DW_AT_decl_line   : (data1) 100
     <3f2>   DW_AT_decl_column : (data1) 8
     <3f3>   DW_AT_sibling     : (ref4) <0x412>
  <2><3f7>: Abbrev Number: 15 (DW_TAG_member)
-    <3f8>   DW_AT_name        : (strp) (offset: 0x584): ob_refcnt
+    <3f8>   DW_AT_name        : (strp) (offset: 0x5de): ob_refcnt
     <3fc>   DW_AT_decl_file   : (data1) 2
     <3fd>   DW_AT_decl_line   : (data1) 102
     <3fe>   DW_AT_decl_column : (data1) 16
     <3ff>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
     <403>   DW_AT_data_member_location: (data1) 0
  <2><404>: Abbrev Number: 15 (DW_TAG_member)
-    <405>   DW_AT_name        : (strp) (offset: 0x222b): ob_type
+    <405>   DW_AT_name        : (strp) (offset: 0x234f): ob_type
     <409>   DW_AT_decl_file   : (data1) 2
     <40a>   DW_AT_decl_line   : (data1) 103
     <40b>   DW_AT_decl_column : (data1) 19
     <40c>   DW_AT_type        : (ref4) <0xb83>, PyTypeObject, _typeobject
     <410>   DW_AT_data_member_location: (data1) 8
  <2><411>: Abbrev Number: 0
  <1><412>: Abbrev Number: 3 (DW_TAG_typedef)
-    <413>   DW_AT_name        : (strp) (offset: 0xd78): PyLongObject
+    <413>   DW_AT_name        : (strp) (offset: 0xe3f): PyLongObject
     <417>   DW_AT_decl_file   : (data1) 13
     <418>   DW_AT_decl_line   : (data1) 19
     <419>   DW_AT_decl_column : (data1) 28
     <41a>   DW_AT_type        : (ref4) <0x41e>, _longobject
  <1><41e>: Abbrev Number: 14 (DW_TAG_structure_type)
-    <41f>   DW_AT_name        : (strp) (offset: 0x1eb7): _longobject
+    <41f>   DW_AT_name        : (strp) (offset: 0x1fdb): _longobject
     <423>   DW_AT_byte_size   : (data1) 32
     <424>   DW_AT_decl_file   : (data1) 17
     <425>   DW_AT_decl_line   : (data1) 82
     <426>   DW_AT_decl_column : (data1) 8
     <427>   DW_AT_sibling     : (ref4) <0x446>
  <2><42b>: Abbrev Number: 15 (DW_TAG_member)
-    <42c>   DW_AT_name        : (strp) (offset: 0x397): ob_base
+    <42c>   DW_AT_name        : (strp) (offset: 0x3dd): ob_base
     <430>   DW_AT_decl_file   : (data1) 17
     <431>   DW_AT_decl_line   : (data1) 83
     <432>   DW_AT_decl_column : (data1) 5
     <433>   DW_AT_type        : (ref4) <0xbad>, PyVarObject
     <437>   DW_AT_data_member_location: (data1) 0
  <2><438>: Abbrev Number: 15 (DW_TAG_member)
-    <439>   DW_AT_name        : (strp) (offset: 0xb44): ob_digit
+    <439>   DW_AT_name        : (strp) (offset: 0xc33): ob_digit
     <43d>   DW_AT_decl_file   : (data1) 17
     <43e>   DW_AT_decl_line   : (data1) 84
     <43f>   DW_AT_decl_column : (data1) 11
     <440>   DW_AT_type        : (ref4) <0x177e>, digit, uint32_t, unsigned int
     <444>   DW_AT_data_member_location: (data1) 24
  <2><445>: Abbrev Number: 0
  <1><446>: Abbrev Number: 3 (DW_TAG_typedef)
-    <447>   DW_AT_name        : (strp) (offset: 0xaf6): PyTypeObject
+    <447>   DW_AT_name        : (strp) (offset: 0xbd6): PyTypeObject
     <44b>   DW_AT_decl_file   : (data1) 13
     <44c>   DW_AT_decl_line   : (data1) 20
     <44d>   DW_AT_decl_column : (data1) 28
     <44e>   DW_AT_type        : (ref4) <0x452>, _typeobject
  <1><452>: Abbrev Number: 17 (DW_TAG_structure_type)
-    <453>   DW_AT_name        : (strp) (offset: 0x10ed): _typeobject
+    <453>   DW_AT_name        : (strp) (offset: 0x11be): _typeobject
     <457>   DW_AT_byte_size   : (data2) 408
     <459>   DW_AT_decl_file   : (data1) 18
     <45a>   DW_AT_decl_line   : (data1) 148
     <45b>   DW_AT_decl_column : (data1) 8
     <45c>   DW_AT_sibling     : (ref4) <0x6f1>
  <2><460>: Abbrev Number: 15 (DW_TAG_member)
-    <461>   DW_AT_name        : (strp) (offset: 0x397): ob_base
+    <461>   DW_AT_name        : (strp) (offset: 0x3dd): ob_base
     <465>   DW_AT_decl_file   : (data1) 18
     <466>   DW_AT_decl_line   : (data1) 149
     <467>   DW_AT_decl_column : (data1) 5
     <468>   DW_AT_type        : (ref4) <0xbad>, PyVarObject
     <46c>   DW_AT_data_member_location: (data1) 0
  <2><46d>: Abbrev Number: 15 (DW_TAG_member)
-    <46e>   DW_AT_name        : (strp) (offset: 0x4c3): tp_name
+    <46e>   DW_AT_name        : (strp) (offset: 0x51d): tp_name
     <472>   DW_AT_decl_file   : (data1) 18
     <473>   DW_AT_decl_line   : (data1) 150
     <474>   DW_AT_decl_column : (data1) 17
     <475>   DW_AT_type        : (ref4) <0xf0>, char
     <479>   DW_AT_data_member_location: (data1) 24
  <2><47a>: Abbrev Number: 15 (DW_TAG_member)
-    <47b>   DW_AT_name        : (strp) (offset: 0x1d75): tp_basicsize
+    <47b>   DW_AT_name        : (strp) (offset: 0x1e7c): tp_basicsize
     <47f>   DW_AT_decl_file   : (data1) 18
     <480>   DW_AT_decl_line   : (data1) 151
     <481>   DW_AT_decl_column : (data1) 16
     <482>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
     <486>   DW_AT_data_member_location: (data1) 32
  <2><487>: Abbrev Number: 15 (DW_TAG_member)
-    <488>   DW_AT_name        : (strp) (offset: 0x1e66): tp_itemsize
+    <488>   DW_AT_name        : (strp) (offset: 0x1f8a): tp_itemsize
     <48c>   DW_AT_decl_file   : (data1) 18
     <48d>   DW_AT_decl_line   : (data1) 151
     <48e>   DW_AT_decl_column : (data1) 30
     <48f>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
     <493>   DW_AT_data_member_location: (data1) 40
  <2><494>: Abbrev Number: 15 (DW_TAG_member)
     <495>   DW_AT_name        : (strp) (offset: 0x18e): tp_dealloc
     <499>   DW_AT_decl_file   : (data1) 18
     <49a>   DW_AT_decl_line   : (data1) 155
     <49b>   DW_AT_decl_column : (data1) 16
     <49c>   DW_AT_type        : (ref4) <0xd7d>, destructor
     <4a0>   DW_AT_data_member_location: (data1) 48
  <2><4a1>: Abbrev Number: 15 (DW_TAG_member)
-    <4a2>   DW_AT_name        : (strp) (offset: 0x904): tp_vectorcall_offset
+    <4a2>   DW_AT_name        : (strp) (offset: 0x9e4): tp_vectorcall_offset
     <4a6>   DW_AT_decl_file   : (data1) 18
     <4a7>   DW_AT_decl_line   : (data1) 156
     <4a8>   DW_AT_decl_column : (data1) 16
     <4a9>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
     <4ad>   DW_AT_data_member_location: (data1) 56
  <2><4ae>: Abbrev Number: 15 (DW_TAG_member)
-    <4af>   DW_AT_name        : (strp) (offset: 0x1cee): tp_getattr
+    <4af>   DW_AT_name        : (strp) (offset: 0x1deb): tp_getattr
     <4b3>   DW_AT_decl_file   : (data1) 18
     <4b4>   DW_AT_decl_line   : (data1) 157
     <4b5>   DW_AT_decl_column : (data1) 17
     <4b6>   DW_AT_type        : (ref4) <0xd9a>, getattrfunc, PyObject, _object
     <4ba>   DW_AT_data_member_location: (data1) 64
  <2><4bb>: Abbrev Number: 15 (DW_TAG_member)
-    <4bc>   DW_AT_name        : (strp) (offset: 0xe37): tp_setattr
+    <4bc>   DW_AT_name        : (strp) (offset: 0xefe): tp_setattr
     <4c0>   DW_AT_decl_file   : (data1) 18
     <4c1>   DW_AT_decl_line   : (data1) 158
     <4c2>   DW_AT_decl_column : (data1) 17
     <4c3>   DW_AT_type        : (ref4) <0xdcc>, setattrfunc, int
     <4c7>   DW_AT_data_member_location: (data1) 72
  <2><4c8>: Abbrev Number: 15 (DW_TAG_member)
-    <4c9>   DW_AT_name        : (strp) (offset: 0x19eb): tp_as_async
+    <4c9>   DW_AT_name        : (strp) (offset: 0x1adf): tp_as_async
     <4cd>   DW_AT_decl_file   : (data1) 18
     <4ce>   DW_AT_decl_line   : (data1) 159
     <4cf>   DW_AT_decl_column : (data1) 21
     <4d0>   DW_AT_type        : (ref4) <0x13dd>, PyAsyncMethods
     <4d4>   DW_AT_data_member_location: (data1) 80
  <2><4d5>: Abbrev Number: 15 (DW_TAG_member)
-    <4d6>   DW_AT_name        : (strp) (offset: 0x224): tp_repr
+    <4d6>   DW_AT_name        : (strp) (offset: 0x233): tp_repr
     <4da>   DW_AT_decl_file   : (data1) 18
     <4db>   DW_AT_decl_line   : (data1) 161
     <4dc>   DW_AT_decl_column : (data1) 14
     <4dd>   DW_AT_type        : (ref4) <0xe03>, reprfunc, PyObject, _object
     <4e1>   DW_AT_data_member_location: (data1) 88
  <2><4e2>: Abbrev Number: 15 (DW_TAG_member)
-    <4e3>   DW_AT_name        : (strp) (offset: 0x1f76): tp_as_number
+    <4e3>   DW_AT_name        : (strp) (offset: 0x209a): tp_as_number
     <4e7>   DW_AT_decl_file   : (data1) 18
     <4e8>   DW_AT_decl_line   : (data1) 165
     <4e9>   DW_AT_decl_column : (data1) 22
     <4ea>   DW_AT_type        : (ref4) <0x13e3>, PyNumberMethods
     <4ee>   DW_AT_data_member_location: (data1) 96
  <2><4ef>: Abbrev Number: 15 (DW_TAG_member)
-    <4f0>   DW_AT_name        : (strp) (offset: 0x215): tp_as_sequence
+    <4f0>   DW_AT_name        : (strp) (offset: 0x224): tp_as_sequence
     <4f4>   DW_AT_decl_file   : (data1) 18
     <4f5>   DW_AT_decl_line   : (data1) 166
     <4f6>   DW_AT_decl_column : (data1) 24
     <4f7>   DW_AT_type        : (ref4) <0x13e9>, PySequenceMethods
     <4fb>   DW_AT_data_member_location: (data1) 104
  <2><4fc>: Abbrev Number: 15 (DW_TAG_member)
-    <4fd>   DW_AT_name        : (strp) (offset: 0xe01): tp_as_mapping
+    <4fd>   DW_AT_name        : (strp) (offset: 0xec8): tp_as_mapping
     <501>   DW_AT_decl_file   : (data1) 18
     <502>   DW_AT_decl_line   : (data1) 167
     <503>   DW_AT_decl_column : (data1) 23
     <504>   DW_AT_type        : (ref4) <0x13ef>, PyMappingMethods
     <508>   DW_AT_data_member_location: (data1) 112
  <2><509>: Abbrev Number: 15 (DW_TAG_member)
-    <50a>   DW_AT_name        : (strp) (offset: 0xa29): tp_hash
+    <50a>   DW_AT_name        : (strp) (offset: 0xb09): tp_hash
     <50e>   DW_AT_decl_file   : (data1) 18
     <50f>   DW_AT_decl_line   : (data1) 171
     <510>   DW_AT_decl_column : (data1) 14
     <511>   DW_AT_type        : (ref4) <0xe0f>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, long int
     <515>   DW_AT_data_member_location: (data1) 120
  <2><516>: Abbrev Number: 15 (DW_TAG_member)
-    <517>   DW_AT_name        : (strp) (offset: 0x1474): tp_call
+    <517>   DW_AT_name        : (strp) (offset: 0x1536): tp_call
     <51b>   DW_AT_decl_file   : (data1) 18
     <51c>   DW_AT_decl_line   : (data1) 172
     <51d>   DW_AT_decl_column : (data1) 17
     <51e>   DW_AT_type        : (ref4) <0xc00>, ternaryfunc, PyObject, _object
     <522>   DW_AT_data_member_location: (data1) 128
  <2><523>: Abbrev Number: 15 (DW_TAG_member)
-    <524>   DW_AT_name        : (strp) (offset: 0xf2d): tp_str
+    <524>   DW_AT_name        : (strp) (offset: 0xff4): tp_str
     <528>   DW_AT_decl_file   : (data1) 18
     <529>   DW_AT_decl_line   : (data1) 173
     <52a>   DW_AT_decl_column : (data1) 14
     <52b>   DW_AT_type        : (ref4) <0xe03>, reprfunc, PyObject, _object
     <52f>   DW_AT_data_member_location: (data1) 136
  <2><530>: Abbrev Number: 15 (DW_TAG_member)
-    <531>   DW_AT_name        : (strp) (offset: 0xb8c): tp_getattro
+    <531>   DW_AT_name        : (strp) (offset: 0xc7b): tp_getattro
     <535>   DW_AT_decl_file   : (data1) 18
     <536>   DW_AT_decl_line   : (data1) 174
     <537>   DW_AT_decl_column : (data1) 18
     <538>   DW_AT_type        : (ref4) <0xdc0>, getattrofunc, PyObject, _object
     <53c>   DW_AT_data_member_location: (data1) 144
  <2><53d>: Abbrev Number: 15 (DW_TAG_member)
-    <53e>   DW_AT_name        : (strp) (offset: 0x179e): tp_setattro
+    <53e>   DW_AT_name        : (strp) (offset: 0x1867): tp_setattro
     <542>   DW_AT_decl_file   : (data1) 18
     <543>   DW_AT_decl_line   : (data1) 175
     <544>   DW_AT_decl_column : (data1) 18
     <545>   DW_AT_type        : (ref4) <0xdf7>, setattrofunc, int
     <549>   DW_AT_data_member_location: (data1) 152
  <2><54a>: Abbrev Number: 15 (DW_TAG_member)
-    <54b>   DW_AT_name        : (strp) (offset: 0x1bda): tp_as_buffer
+    <54b>   DW_AT_name        : (strp) (offset: 0x1cce): tp_as_buffer
     <54f>   DW_AT_decl_file   : (data1) 18
     <550>   DW_AT_decl_line   : (data1) 178
     <551>   DW_AT_decl_column : (data1) 20
     <552>   DW_AT_type        : (ref4) <0x13f5>, PyBufferProcs
     <556>   DW_AT_data_member_location: (data1) 160
  <2><557>: Abbrev Number: 15 (DW_TAG_member)
-    <558>   DW_AT_name        : (strp) (offset: 0x113b): tp_flags
+    <558>   DW_AT_name        : (strp) (offset: 0x120c): tp_flags
     <55c>   DW_AT_decl_file   : (data1) 18
     <55d>   DW_AT_decl_line   : (data1) 181
     <55e>   DW_AT_decl_column : (data1) 19
     <55f>   DW_AT_type        : (ref4) <0x62>, long unsigned int
     <563>   DW_AT_data_member_location: (data1) 168
  <2><564>: Abbrev Number: 15 (DW_TAG_member)
-    <565>   DW_AT_name        : (strp) (offset: 0x77c): tp_doc
+    <565>   DW_AT_name        : (strp) (offset: 0x7f5): tp_doc
     <569>   DW_AT_decl_file   : (data1) 18
     <56a>   DW_AT_decl_line   : (data1) 183
     <56b>   DW_AT_decl_column : (data1) 17
     <56c>   DW_AT_type        : (ref4) <0xf0>, char
     <570>   DW_AT_data_member_location: (data1) 176
  <2><571>: Abbrev Number: 15 (DW_TAG_member)
-    <572>   DW_AT_name        : (strp) (offset: 0xd6c): tp_traverse
+    <572>   DW_AT_name        : (strp) (offset: 0xe33): tp_traverse
     <576>   DW_AT_decl_file   : (data1) 18
     <577>   DW_AT_decl_line   : (data1) 187
     <578>   DW_AT_decl_column : (data1) 18
     <579>   DW_AT_type        : (ref4) <0xd35>, traverseproc, int
     <57d>   DW_AT_data_member_location: (data1) 184
  <2><57e>: Abbrev Number: 15 (DW_TAG_member)
-    <57f>   DW_AT_name        : (strp) (offset: 0x1458): tp_clear
+    <57f>   DW_AT_name        : (strp) (offset: 0x151a): tp_clear
     <583>   DW_AT_decl_file   : (data1) 18
     <584>   DW_AT_decl_line   : (data1) 190
     <585>   DW_AT_decl_column : (data1) 13
     <586>   DW_AT_type        : (ref4) <0xc2b>, inquiry, int
     <58a>   DW_AT_data_member_location: (data1) 192
  <2><58b>: Abbrev Number: 15 (DW_TAG_member)
     <58c>   DW_AT_name        : (strp) (offset: 0x140): tp_richcompare
     <590>   DW_AT_decl_file   : (data1) 18
     <591>   DW_AT_decl_line   : (data1) 194
     <592>   DW_AT_decl_column : (data1) 17
     <593>   DW_AT_type        : (ref4) <0xe30>, richcmpfunc, PyObject, _object
     <597>   DW_AT_data_member_location: (data1) 200
  <2><598>: Abbrev Number: 15 (DW_TAG_member)
-    <599>   DW_AT_name        : (strp) (offset: 0x489): tp_weaklistoffset
+    <599>   DW_AT_name        : (strp) (offset: 0x4e3): tp_weaklistoffset
     <59d>   DW_AT_decl_file   : (data1) 18
     <59e>   DW_AT_decl_line   : (data1) 197
     <59f>   DW_AT_decl_column : (data1) 16
     <5a0>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
     <5a4>   DW_AT_data_member_location: (data1) 208
  <2><5a5>: Abbrev Number: 15 (DW_TAG_member)
-    <5a6>   DW_AT_name        : (strp) (offset: 0x621): tp_iter
+    <5a6>   DW_AT_name        : (strp) (offset: 0x67b): tp_iter
     <5aa>   DW_AT_decl_file   : (data1) 18
     <5ab>   DW_AT_decl_line   : (data1) 200
     <5ac>   DW_AT_decl_column : (data1) 17
     <5ad>   DW_AT_type        : (ref4) <0xe5b>, getiterfunc, PyObject, _object
     <5b1>   DW_AT_data_member_location: (data1) 216
  <2><5b2>: Abbrev Number: 15 (DW_TAG_member)
-    <5b3>   DW_AT_name        : (strp) (offset: 0x144c): tp_iternext
+    <5b3>   DW_AT_name        : (strp) (offset: 0x150e): tp_iternext
     <5b7>   DW_AT_decl_file   : (data1) 18
     <5b8>   DW_AT_decl_line   : (data1) 201
     <5b9>   DW_AT_decl_column : (data1) 18
     <5ba>   DW_AT_type        : (ref4) <0xe67>, iternextfunc, PyObject, _object
     <5be>   DW_AT_data_member_location: (data1) 224
  <2><5bf>: Abbrev Number: 15 (DW_TAG_member)
-    <5c0>   DW_AT_name        : (strp) (offset: 0x36f): tp_methods
+    <5c0>   DW_AT_name        : (strp) (offset: 0x3b5): tp_methods
     <5c4>   DW_AT_decl_file   : (data1) 18
     <5c5>   DW_AT_decl_line   : (data1) 204
     <5c6>   DW_AT_decl_column : (data1) 18
     <5c7>   DW_AT_type        : (ref4) <0x13fb>, PyMethodDef, PyMethodDef
     <5cb>   DW_AT_data_member_location: (data1) 232
  <2><5cc>: Abbrev Number: 15 (DW_TAG_member)
-    <5cd>   DW_AT_name        : (strp) (offset: 0x1629): tp_members
+    <5cd>   DW_AT_name        : (strp) (offset: 0x1703): tp_members
     <5d1>   DW_AT_decl_file   : (data1) 18
     <5d2>   DW_AT_decl_line   : (data1) 205
     <5d3>   DW_AT_decl_column : (data1) 18
     <5d4>   DW_AT_type        : (ref4) <0x1401>, PyMemberDef, PyMemberDef
     <5d8>   DW_AT_data_member_location: (data1) 240
  <2><5d9>: Abbrev Number: 15 (DW_TAG_member)
-    <5da>   DW_AT_name        : (strp) (offset: 0x1b77): tp_getset
+    <5da>   DW_AT_name        : (strp) (offset: 0x1c6b): tp_getset
     <5de>   DW_AT_decl_file   : (data1) 18
     <5df>   DW_AT_decl_line   : (data1) 206
     <5e0>   DW_AT_decl_column : (data1) 18
     <5e1>   DW_AT_type        : (ref4) <0x1407>, PyGetSetDef, PyGetSetDef
     <5e5>   DW_AT_data_member_location: (data1) 248
  <2><5e6>: Abbrev Number: 18 (DW_TAG_member)
-    <5e7>   DW_AT_name        : (strp) (offset: 0x8eb): tp_base
+    <5e7>   DW_AT_name        : (strp) (offset: 0x9cb): tp_base
     <5eb>   DW_AT_decl_file   : (data1) 18
     <5ec>   DW_AT_decl_line   : (data1) 208
     <5ed>   DW_AT_decl_column : (data1) 19
     <5ee>   DW_AT_type        : (ref4) <0xb83>, PyTypeObject, _typeobject
     <5f2>   DW_AT_data_member_location: (data2) 256
  <2><5f4>: Abbrev Number: 18 (DW_TAG_member)
-    <5f5>   DW_AT_name        : (strp) (offset: 0xced): tp_dict
+    <5f5>   DW_AT_name        : (strp) (offset: 0xda8): tp_dict
     <5f9>   DW_AT_decl_file   : (data1) 18
     <5fa>   DW_AT_decl_line   : (data1) 209
     <5fb>   DW_AT_decl_column : (data1) 15
     <5fc>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <600>   DW_AT_data_member_location: (data2) 264
  <2><602>: Abbrev Number: 18 (DW_TAG_member)
-    <603>   DW_AT_name        : (strp) (offset: 0x22bd): tp_descr_get
+    <603>   DW_AT_name        : (strp) (offset: 0x23f5): tp_descr_get
     <607>   DW_AT_decl_file   : (data1) 18
     <608>   DW_AT_decl_line   : (data1) 210
     <609>   DW_AT_decl_column : (data1) 18
     <60a>   DW_AT_type        : (ref4) <0xe73>, descrgetfunc, PyObject, _object
     <60e>   DW_AT_data_member_location: (data2) 272
  <2><610>: Abbrev Number: 18 (DW_TAG_member)
-    <611>   DW_AT_name        : (strp) (offset: 0xc66): tp_descr_set
+    <611>   DW_AT_name        : (strp) (offset: 0xd21): tp_descr_set
     <615>   DW_AT_decl_file   : (data1) 18
     <616>   DW_AT_decl_line   : (data1) 211
     <617>   DW_AT_decl_column : (data1) 18
     <618>   DW_AT_type        : (ref4) <0xe7f>, descrsetfunc, int
     <61c>   DW_AT_data_member_location: (data2) 280
  <2><61e>: Abbrev Number: 18 (DW_TAG_member)
-    <61f>   DW_AT_name        : (strp) (offset: 0x24d2): tp_dictoffset
+    <61f>   DW_AT_name        : (strp) (offset: 0x2614): tp_dictoffset
     <623>   DW_AT_decl_file   : (data1) 18
     <624>   DW_AT_decl_line   : (data1) 212
     <625>   DW_AT_decl_column : (data1) 16
     <626>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
     <62a>   DW_AT_data_member_location: (data2) 288
  <2><62c>: Abbrev Number: 18 (DW_TAG_member)
-    <62d>   DW_AT_name        : (strp) (offset: 0x39f): tp_init
+    <62d>   DW_AT_name        : (strp) (offset: 0x3e5): tp_init
     <631>   DW_AT_decl_file   : (data1) 18
     <632>   DW_AT_decl_line   : (data1) 213
     <633>   DW_AT_decl_column : (data1) 14
     <634>   DW_AT_type        : (ref4) <0xe8b>, initproc, int
     <638>   DW_AT_data_member_location: (data2) 296
  <2><63a>: Abbrev Number: 18 (DW_TAG_member)
-    <63b>   DW_AT_name        : (strp) (offset: 0x1a1e): tp_alloc
+    <63b>   DW_AT_name        : (strp) (offset: 0x1b12): tp_alloc
     <63f>   DW_AT_decl_file   : (data1) 18
     <640>   DW_AT_decl_line   : (data1) 214
     <641>   DW_AT_decl_column : (data1) 15
     <642>   DW_AT_type        : (ref4) <0xec2>, allocfunc, PyObject, _object
     <646>   DW_AT_data_member_location: (data2) 304
  <2><648>: Abbrev Number: 18 (DW_TAG_member)
-    <649>   DW_AT_name        : (strp) (offset: 0x2213): tp_new
+    <649>   DW_AT_name        : (strp) (offset: 0x2337): tp_new
     <64d>   DW_AT_decl_file   : (data1) 18
     <64e>   DW_AT_decl_line   : (data1) 215
     <64f>   DW_AT_decl_column : (data1) 13
     <650>   DW_AT_type        : (ref4) <0xe97>, newfunc, PyObject, _object
     <654>   DW_AT_data_member_location: (data2) 312
  <2><656>: Abbrev Number: 18 (DW_TAG_member)
-    <657>   DW_AT_name        : (strp) (offset: 0x888): tp_free
+    <657>   DW_AT_name        : (strp) (offset: 0x95f): tp_free
     <65b>   DW_AT_decl_file   : (data1) 18
     <65c>   DW_AT_decl_line   : (data1) 216
     <65d>   DW_AT_decl_column : (data1) 14
     <65e>   DW_AT_type        : (ref4) <0xd60>, freefunc
     <662>   DW_AT_data_member_location: (data2) 320
  <2><664>: Abbrev Number: 18 (DW_TAG_member)
-    <665>   DW_AT_name        : (strp) (offset: 0x49b): tp_is_gc
+    <665>   DW_AT_name        : (strp) (offset: 0x4f5): tp_is_gc
     <669>   DW_AT_decl_file   : (data1) 18
     <66a>   DW_AT_decl_line   : (data1) 217
     <66b>   DW_AT_decl_column : (data1) 13
     <66c>   DW_AT_type        : (ref4) <0xc2b>, inquiry, int
     <670>   DW_AT_data_member_location: (data2) 328
  <2><672>: Abbrev Number: 18 (DW_TAG_member)
-    <673>   DW_AT_name        : (strp) (offset: 0x355): tp_bases
+    <673>   DW_AT_name        : (strp) (offset: 0x39b): tp_bases
     <677>   DW_AT_decl_file   : (data1) 18
     <678>   DW_AT_decl_line   : (data1) 218
     <679>   DW_AT_decl_column : (data1) 15
     <67a>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <67e>   DW_AT_data_member_location: (data2) 336
  <2><680>: Abbrev Number: 18 (DW_TAG_member)
-    <681>   DW_AT_name        : (strp) (offset: 0x52a): tp_mro
+    <681>   DW_AT_name        : (strp) (offset: 0x584): tp_mro
     <685>   DW_AT_decl_file   : (data1) 18
     <686>   DW_AT_decl_line   : (data1) 219
     <687>   DW_AT_decl_column : (data1) 15
     <688>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <68c>   DW_AT_data_member_location: (data2) 344
  <2><68e>: Abbrev Number: 18 (DW_TAG_member)
-    <68f>   DW_AT_name        : (strp) (offset: 0x1d6c): tp_cache
+    <68f>   DW_AT_name        : (strp) (offset: 0x1e73): tp_cache
     <693>   DW_AT_decl_file   : (data1) 18
     <694>   DW_AT_decl_line   : (data1) 220
     <695>   DW_AT_decl_column : (data1) 15
     <696>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <69a>   DW_AT_data_member_location: (data2) 352
  <2><69c>: Abbrev Number: 18 (DW_TAG_member)
-    <69d>   DW_AT_name        : (strp) (offset: 0x2446): tp_subclasses
+    <69d>   DW_AT_name        : (strp) (offset: 0x2588): tp_subclasses
     <6a1>   DW_AT_decl_file   : (data1) 18
     <6a2>   DW_AT_decl_line   : (data1) 221
     <6a3>   DW_AT_decl_column : (data1) 15
     <6a4>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <6a8>   DW_AT_data_member_location: (data2) 360
  <2><6aa>: Abbrev Number: 18 (DW_TAG_member)
-    <6ab>   DW_AT_name        : (strp) (offset: 0x1ba6): tp_weaklist
+    <6ab>   DW_AT_name        : (strp) (offset: 0x1c9a): tp_weaklist
     <6af>   DW_AT_decl_file   : (data1) 18
     <6b0>   DW_AT_decl_line   : (data1) 222
     <6b1>   DW_AT_decl_column : (data1) 15
     <6b2>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <6b6>   DW_AT_data_member_location: (data2) 368
  <2><6b8>: Abbrev Number: 18 (DW_TAG_member)
-    <6b9>   DW_AT_name        : (strp) (offset: 0x216b): tp_del
+    <6b9>   DW_AT_name        : (strp) (offset: 0x228f): tp_del
     <6bd>   DW_AT_decl_file   : (data1) 18
     <6be>   DW_AT_decl_line   : (data1) 223
     <6bf>   DW_AT_decl_column : (data1) 16
     <6c0>   DW_AT_type        : (ref4) <0xd7d>, destructor
     <6c4>   DW_AT_data_member_location: (data2) 376
  <2><6c6>: Abbrev Number: 18 (DW_TAG_member)
-    <6c7>   DW_AT_name        : (strp) (offset: 0x1cc9): tp_version_tag
+    <6c7>   DW_AT_name        : (strp) (offset: 0x1dc6): tp_version_tag
     <6cb>   DW_AT_decl_file   : (data1) 18
     <6cc>   DW_AT_decl_line   : (data1) 226
     <6cd>   DW_AT_decl_column : (data1) 18
     <6ce>   DW_AT_type        : (ref4) <0x7c>, unsigned int
     <6d2>   DW_AT_data_member_location: (data2) 384
  <2><6d4>: Abbrev Number: 18 (DW_TAG_member)
-    <6d5>   DW_AT_name        : (strp) (offset: 0x207d): tp_finalize
+    <6d5>   DW_AT_name        : (strp) (offset: 0x21a1): tp_finalize
     <6d9>   DW_AT_decl_file   : (data1) 18
     <6da>   DW_AT_decl_line   : (data1) 228
     <6db>   DW_AT_decl_column : (data1) 16
     <6dc>   DW_AT_type        : (ref4) <0xd7d>, destructor
     <6e0>   DW_AT_data_member_location: (data2) 392
  <2><6e2>: Abbrev Number: 18 (DW_TAG_member)
-    <6e3>   DW_AT_name        : (strp) (offset: 0x1c09): tp_vectorcall
+    <6e3>   DW_AT_name        : (strp) (offset: 0x1cfd): tp_vectorcall
     <6e7>   DW_AT_decl_file   : (data1) 18
     <6e8>   DW_AT_decl_line   : (data1) 229
     <6e9>   DW_AT_decl_column : (data1) 20
     <6ea>   DW_AT_type        : (ref4) <0x1038>, vectorcallfunc, PyObject, _object
     <6ee>   DW_AT_data_member_location: (data2) 400
  <2><6f0>: Abbrev Number: 0
  <1><6f1>: Abbrev Number: 3 (DW_TAG_typedef)
-    <6f2>   DW_AT_name        : (strp) (offset: 0xd2e): PyCodeObject
+    <6f2>   DW_AT_name        : (strp) (offset: 0xde9): PyCodeObject
     <6f6>   DW_AT_decl_file   : (data1) 13
     <6f7>   DW_AT_decl_line   : (data1) 21
     <6f8>   DW_AT_decl_column : (data1) 29
     <6f9>   DW_AT_type        : (ref4) <0x6fd>, PyCodeObject
  <1><6fd>: Abbrev Number: 14 (DW_TAG_structure_type)
-    <6fe>   DW_AT_name        : (strp) (offset: 0xd2e): PyCodeObject
+    <6fe>   DW_AT_name        : (strp) (offset: 0xde9): PyCodeObject
     <702>   DW_AT_byte_size   : (data1) 192
     <703>   DW_AT_decl_file   : (data1) 19
     <704>   DW_AT_decl_line   : (data1) 103
     <705>   DW_AT_decl_column : (data1) 8
     <706>   DW_AT_sibling     : (ref4) <0x884>
  <2><70a>: Abbrev Number: 15 (DW_TAG_member)
-    <70b>   DW_AT_name        : (strp) (offset: 0x397): ob_base
+    <70b>   DW_AT_name        : (strp) (offset: 0x3dd): ob_base
     <70f>   DW_AT_decl_file   : (data1) 19
     <710>   DW_AT_decl_line   : (data1) 103
     <711>   DW_AT_decl_column : (data1) 21
     <712>   DW_AT_type        : (ref4) <0xbad>, PyVarObject
     <716>   DW_AT_data_member_location: (data1) 0
  <2><717>: Abbrev Number: 15 (DW_TAG_member)
-    <718>   DW_AT_name        : (strp) (offset: 0x115e): co_consts
+    <718>   DW_AT_name        : (strp) (offset: 0x122f): co_consts
     <71c>   DW_AT_decl_file   : (data1) 19
     <71d>   DW_AT_decl_line   : (data1) 103
     <71e>   DW_AT_decl_column : (data1) 21
     <71f>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <723>   DW_AT_data_member_location: (data1) 24
  <2><724>: Abbrev Number: 15 (DW_TAG_member)
-    <725>   DW_AT_name        : (strp) (offset: 0x12e9): co_names
+    <725>   DW_AT_name        : (strp) (offset: 0x13ba): co_names
     <729>   DW_AT_decl_file   : (data1) 19
     <72a>   DW_AT_decl_line   : (data1) 103
     <72b>   DW_AT_decl_column : (data1) 21
     <72c>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <730>   DW_AT_data_member_location: (data1) 32
  <2><731>: Abbrev Number: 15 (DW_TAG_member)
-    <732>   DW_AT_name        : (strp) (offset: 0xd5a): co_exceptiontable
+    <732>   DW_AT_name        : (strp) (offset: 0xe21): co_exceptiontable
     <736>   DW_AT_decl_file   : (data1) 19
     <737>   DW_AT_decl_line   : (data1) 103
     <738>   DW_AT_decl_column : (data1) 21
     <739>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <73d>   DW_AT_data_member_location: (data1) 40
  <2><73e>: Abbrev Number: 15 (DW_TAG_member)
-    <73f>   DW_AT_name        : (strp) (offset: 0x2331): co_flags
+    <73f>   DW_AT_name        : (strp) (offset: 0x2469): co_flags
     <743>   DW_AT_decl_file   : (data1) 19
     <744>   DW_AT_decl_line   : (data1) 103
     <745>   DW_AT_decl_column : (data1) 21
     <746>   DW_AT_type        : (ref4) <0x4f>, int
     <74a>   DW_AT_data_member_location: (data1) 48
  <2><74b>: Abbrev Number: 15 (DW_TAG_member)
-    <74c>   DW_AT_name        : (strp) (offset: 0x1b43): co_warmup
+    <74c>   DW_AT_name        : (strp) (offset: 0x1c37): co_warmup
     <750>   DW_AT_decl_file   : (data1) 19
     <751>   DW_AT_decl_line   : (data1) 103
     <752>   DW_AT_decl_column : (data1) 21
     <753>   DW_AT_type        : (ref4) <0x168>, short int
     <757>   DW_AT_data_member_location: (data1) 52
  <2><758>: Abbrev Number: 15 (DW_TAG_member)
-    <759>   DW_AT_name        : (strp) (offset: 0xcc2): _co_linearray_entry_size
+    <759>   DW_AT_name        : (strp) (offset: 0xd7d): _co_linearray_entry_size
     <75d>   DW_AT_decl_file   : (data1) 19
     <75e>   DW_AT_decl_line   : (data1) 103
     <75f>   DW_AT_decl_column : (data1) 21
     <760>   DW_AT_type        : (ref4) <0x168>, short int
     <764>   DW_AT_data_member_location: (data1) 54
  <2><765>: Abbrev Number: 15 (DW_TAG_member)
-    <766>   DW_AT_name        : (strp) (offset: 0x47d): co_argcount
+    <766>   DW_AT_name        : (strp) (offset: 0x4d7): co_argcount
     <76a>   DW_AT_decl_file   : (data1) 19
     <76b>   DW_AT_decl_line   : (data1) 103
     <76c>   DW_AT_decl_column : (data1) 21
     <76d>   DW_AT_type        : (ref4) <0x4f>, int
     <771>   DW_AT_data_member_location: (data1) 56
  <2><772>: Abbrev Number: 15 (DW_TAG_member)
-    <773>   DW_AT_name        : (strp) (offset: 0x1006): co_posonlyargcount
+    <773>   DW_AT_name        : (strp) (offset: 0x10e1): co_posonlyargcount
     <777>   DW_AT_decl_file   : (data1) 19
     <778>   DW_AT_decl_line   : (data1) 103
     <779>   DW_AT_decl_column : (data1) 21
     <77a>   DW_AT_type        : (ref4) <0x4f>, int
     <77e>   DW_AT_data_member_location: (data1) 60
  <2><77f>: Abbrev Number: 15 (DW_TAG_member)
-    <780>   DW_AT_name        : (strp) (offset: 0x120b): co_kwonlyargcount
+    <780>   DW_AT_name        : (strp) (offset: 0x12dc): co_kwonlyargcount
     <784>   DW_AT_decl_file   : (data1) 19
     <785>   DW_AT_decl_line   : (data1) 103
     <786>   DW_AT_decl_column : (data1) 21
     <787>   DW_AT_type        : (ref4) <0x4f>, int
     <78b>   DW_AT_data_member_location: (data1) 64
  <2><78c>: Abbrev Number: 15 (DW_TAG_member)
-    <78d>   DW_AT_name        : (strp) (offset: 0x558): co_stacksize
+    <78d>   DW_AT_name        : (strp) (offset: 0x5b2): co_stacksize
     <791>   DW_AT_decl_file   : (data1) 19
     <792>   DW_AT_decl_line   : (data1) 103
     <793>   DW_AT_decl_column : (data1) 21
     <794>   DW_AT_type        : (ref4) <0x4f>, int
     <798>   DW_AT_data_member_location: (data1) 68
  <2><799>: Abbrev Number: 15 (DW_TAG_member)
-    <79a>   DW_AT_name        : (strp) (offset: 0xbd5): co_firstlineno
+    <79a>   DW_AT_name        : (strp) (offset: 0xcc4): co_firstlineno
     <79e>   DW_AT_decl_file   : (data1) 19
     <79f>   DW_AT_decl_line   : (data1) 103
     <7a0>   DW_AT_decl_column : (data1) 21
     <7a1>   DW_AT_type        : (ref4) <0x4f>, int
     <7a5>   DW_AT_data_member_location: (data1) 72
  <2><7a6>: Abbrev Number: 15 (DW_TAG_member)
-    <7a7>   DW_AT_name        : (strp) (offset: 0x233a): co_nlocalsplus
+    <7a7>   DW_AT_name        : (strp) (offset: 0x2472): co_nlocalsplus
     <7ab>   DW_AT_decl_file   : (data1) 19
     <7ac>   DW_AT_decl_line   : (data1) 103
     <7ad>   DW_AT_decl_column : (data1) 21
     <7ae>   DW_AT_type        : (ref4) <0x4f>, int
     <7b2>   DW_AT_data_member_location: (data1) 76
  <2><7b3>: Abbrev Number: 15 (DW_TAG_member)
-    <7b4>   DW_AT_name        : (strp) (offset: 0x9b7): co_nlocals
+    <7b4>   DW_AT_name        : (strp) (offset: 0xa97): co_nlocals
     <7b8>   DW_AT_decl_file   : (data1) 19
     <7b9>   DW_AT_decl_line   : (data1) 103
     <7ba>   DW_AT_decl_column : (data1) 21
     <7bb>   DW_AT_type        : (ref4) <0x4f>, int
     <7bf>   DW_AT_data_member_location: (data1) 80
  <2><7c0>: Abbrev Number: 15 (DW_TAG_member)
-    <7c1>   DW_AT_name        : (strp) (offset: 0x978): co_nplaincellvars
+    <7c1>   DW_AT_name        : (strp) (offset: 0xa58): co_nplaincellvars
     <7c5>   DW_AT_decl_file   : (data1) 19
     <7c6>   DW_AT_decl_line   : (data1) 103
     <7c7>   DW_AT_decl_column : (data1) 21
     <7c8>   DW_AT_type        : (ref4) <0x4f>, int
     <7cc>   DW_AT_data_member_location: (data1) 84
  <2><7cd>: Abbrev Number: 15 (DW_TAG_member)
-    <7ce>   DW_AT_name        : (strp) (offset: 0x1c8e): co_ncellvars
+    <7ce>   DW_AT_name        : (strp) (offset: 0x1d82): co_ncellvars
     <7d2>   DW_AT_decl_file   : (data1) 19
     <7d3>   DW_AT_decl_line   : (data1) 103
     <7d4>   DW_AT_decl_column : (data1) 21
     <7d5>   DW_AT_type        : (ref4) <0x4f>, int
     <7d9>   DW_AT_data_member_location: (data1) 88
  <2><7da>: Abbrev Number: 15 (DW_TAG_member)
-    <7db>   DW_AT_name        : (strp) (offset: 0x1cbc): co_nfreevars
+    <7db>   DW_AT_name        : (strp) (offset: 0x1db9): co_nfreevars
     <7df>   DW_AT_decl_file   : (data1) 19
     <7e0>   DW_AT_decl_line   : (data1) 103
     <7e1>   DW_AT_decl_column : (data1) 21
     <7e2>   DW_AT_type        : (ref4) <0x4f>, int
     <7e6>   DW_AT_data_member_location: (data1) 92
  <2><7e7>: Abbrev Number: 15 (DW_TAG_member)
-    <7e8>   DW_AT_name        : (strp) (offset: 0x1598): co_localsplusnames
+    <7e8>   DW_AT_name        : (strp) (offset: 0x1672): co_localsplusnames
     <7ec>   DW_AT_decl_file   : (data1) 19
     <7ed>   DW_AT_decl_line   : (data1) 103
     <7ee>   DW_AT_decl_column : (data1) 21
     <7ef>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <7f3>   DW_AT_data_member_location: (data1) 96
  <2><7f4>: Abbrev Number: 15 (DW_TAG_member)
-    <7f5>   DW_AT_name        : (strp) (offset: 0x8b5): co_localspluskinds
+    <7f5>   DW_AT_name        : (strp) (offset: 0x995): co_localspluskinds
     <7f9>   DW_AT_decl_file   : (data1) 19
     <7fa>   DW_AT_decl_line   : (data1) 103
     <7fb>   DW_AT_decl_column : (data1) 21
     <7fc>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <800>   DW_AT_data_member_location: (data1) 104
  <2><801>: Abbrev Number: 15 (DW_TAG_member)
-    <802>   DW_AT_name        : (strp) (offset: 0x15d1): co_filename
+    <802>   DW_AT_name        : (strp) (offset: 0x16ab): co_filename
     <806>   DW_AT_decl_file   : (data1) 19
     <807>   DW_AT_decl_line   : (data1) 103
     <808>   DW_AT_decl_column : (data1) 21
     <809>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <80d>   DW_AT_data_member_location: (data1) 112
  <2><80e>: Abbrev Number: 15 (DW_TAG_member)
-    <80f>   DW_AT_name        : (strp) (offset: 0xb9d): co_name
+    <80f>   DW_AT_name        : (strp) (offset: 0xc8c): co_name
     <813>   DW_AT_decl_file   : (data1) 19
     <814>   DW_AT_decl_line   : (data1) 103
     <815>   DW_AT_decl_column : (data1) 21
     <816>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <81a>   DW_AT_data_member_location: (data1) 120
  <2><81b>: Abbrev Number: 15 (DW_TAG_member)
-    <81c>   DW_AT_name        : (strp) (offset: 0x24ed): co_qualname
+    <81c>   DW_AT_name        : (strp) (offset: 0x262f): co_qualname
     <820>   DW_AT_decl_file   : (data1) 19
     <821>   DW_AT_decl_line   : (data1) 103
     <822>   DW_AT_decl_column : (data1) 21
     <823>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <827>   DW_AT_data_member_location: (data1) 128
  <2><828>: Abbrev Number: 15 (DW_TAG_member)
-    <829>   DW_AT_name        : (strp) (offset: 0x439): co_linetable
+    <829>   DW_AT_name        : (strp) (offset: 0x493): co_linetable
     <82d>   DW_AT_decl_file   : (data1) 19
     <82e>   DW_AT_decl_line   : (data1) 103
     <82f>   DW_AT_decl_column : (data1) 21
     <830>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <834>   DW_AT_data_member_location: (data1) 136
  <2><835>: Abbrev Number: 15 (DW_TAG_member)
-    <836>   DW_AT_name        : (strp) (offset: 0x1fb8): co_weakreflist
+    <836>   DW_AT_name        : (strp) (offset: 0x20dc): co_weakreflist
     <83a>   DW_AT_decl_file   : (data1) 19
     <83b>   DW_AT_decl_line   : (data1) 103
     <83c>   DW_AT_decl_column : (data1) 21
     <83d>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <841>   DW_AT_data_member_location: (data1) 144
  <2><842>: Abbrev Number: 15 (DW_TAG_member)
-    <843>   DW_AT_name        : (strp) (offset: 0x71b): _co_code
+    <843>   DW_AT_name        : (strp) (offset: 0x794): _co_code
     <847>   DW_AT_decl_file   : (data1) 19
     <848>   DW_AT_decl_line   : (data1) 103
     <849>   DW_AT_decl_column : (data1) 21
     <84a>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <84e>   DW_AT_data_member_location: (data1) 152
  <2><84f>: Abbrev Number: 15 (DW_TAG_member)
-    <850>   DW_AT_name        : (strp) (offset: 0x207): _co_linearray
+    <850>   DW_AT_name        : (strp) (offset: 0x216): _co_linearray
     <854>   DW_AT_decl_file   : (data1) 19
     <855>   DW_AT_decl_line   : (data1) 103
     <856>   DW_AT_decl_column : (data1) 21
     <857>   DW_AT_type        : (ref4) <0xea>, char
     <85b>   DW_AT_data_member_location: (data1) 160
  <2><85c>: Abbrev Number: 15 (DW_TAG_member)
-    <85d>   DW_AT_name        : (strp) (offset: 0x6ca): _co_firsttraceable
+    <85d>   DW_AT_name        : (strp) (offset: 0x743): _co_firsttraceable
     <861>   DW_AT_decl_file   : (data1) 19
     <862>   DW_AT_decl_line   : (data1) 103
     <863>   DW_AT_decl_column : (data1) 21
     <864>   DW_AT_type        : (ref4) <0x4f>, int
     <868>   DW_AT_data_member_location: (data1) 168
  <2><869>: Abbrev Number: 15 (DW_TAG_member)
-    <86a>   DW_AT_name        : (strp) (offset: 0xc2d): co_extra
+    <86a>   DW_AT_name        : (strp) (offset: 0xcdc): co_extra
     <86e>   DW_AT_decl_file   : (data1) 19
     <86f>   DW_AT_decl_line   : (data1) 103
     <870>   DW_AT_decl_column : (data1) 21
     <871>   DW_AT_type        : (ref4) <0x88>
     <875>   DW_AT_data_member_location: (data1) 176
  <2><876>: Abbrev Number: 15 (DW_TAG_member)
-    <877>   DW_AT_name        : (strp) (offset: 0x22e5): co_code_adaptive
+    <877>   DW_AT_name        : (strp) (offset: 0x241d): co_code_adaptive
     <87b>   DW_AT_decl_file   : (data1) 19
     <87c>   DW_AT_decl_line   : (data1) 103
     <87d>   DW_AT_decl_column : (data1) 21
     <87e>   DW_AT_type        : (ref4) <0x1645>, char
     <882>   DW_AT_data_member_location: (data1) 184
  <2><883>: Abbrev Number: 0
  <1><884>: Abbrev Number: 3 (DW_TAG_typedef)
     <885>   DW_AT_name        : (strp) (offset: 0x156): PyFrameObject
     <889>   DW_AT_decl_file   : (data1) 13
     <88a>   DW_AT_decl_line   : (data1) 22
     <88b>   DW_AT_decl_column : (data1) 23
     <88c>   DW_AT_type        : (ref4) <0x890>, _frame
  <1><890>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <891>   DW_AT_name        : (strp) (offset: 0x57d): _frame
+    <891>   DW_AT_name        : (strp) (offset: 0x5d7): _frame
     <895>   DW_AT_declaration : (flag_present) 1
  <1><895>: Abbrev Number: 3 (DW_TAG_typedef)
-    <896>   DW_AT_name        : (strp) (offset: 0xa90): PyThreadState
+    <896>   DW_AT_name        : (strp) (offset: 0xb70): PyThreadState
     <89a>   DW_AT_decl_file   : (data1) 13
     <89b>   DW_AT_decl_line   : (data1) 24
     <89c>   DW_AT_decl_column : (data1) 20
     <89d>   DW_AT_type        : (ref4) <0x8a1>, _ts
  <1><8a1>: Abbrev Number: 19 (DW_TAG_structure_type)
     <8a2>   DW_AT_name        : (string) _ts
     <8a6>   DW_AT_byte_size   : (data2) 360
     <8a8>   DW_AT_decl_file   : (data1) 20
     <8a9>   DW_AT_decl_line   : (data1) 82
     <8aa>   DW_AT_decl_column : (data1) 8
     <8ab>   DW_AT_sibling     : (ref4) <0xabc>
  <2><8af>: Abbrev Number: 15 (DW_TAG_member)
-    <8b0>   DW_AT_name        : (strp) (offset: 0x2491): prev
+    <8b0>   DW_AT_name        : (strp) (offset: 0x25d3): prev
     <8b4>   DW_AT_decl_file   : (data1) 20
     <8b5>   DW_AT_decl_line   : (data1) 85
     <8b6>   DW_AT_decl_column : (data1) 20
     <8b7>   DW_AT_type        : (ref4) <0x1d35>, PyThreadState, _ts
     <8bb>   DW_AT_data_member_location: (data1) 0
  <2><8bc>: Abbrev Number: 15 (DW_TAG_member)
-    <8bd>   DW_AT_name        : (strp) (offset: 0x23d6): next
+    <8bd>   DW_AT_name        : (strp) (offset: 0x250e): next
     <8c1>   DW_AT_decl_file   : (data1) 20
     <8c2>   DW_AT_decl_line   : (data1) 86
     <8c3>   DW_AT_decl_column : (data1) 20
     <8c4>   DW_AT_type        : (ref4) <0x1d35>, PyThreadState, _ts
     <8c8>   DW_AT_data_member_location: (data1) 8
  <2><8c9>: Abbrev Number: 15 (DW_TAG_member)
-    <8ca>   DW_AT_name        : (strp) (offset: 0x5a2): interp
+    <8ca>   DW_AT_name        : (strp) (offset: 0x5fc): interp
     <8ce>   DW_AT_decl_file   : (data1) 20
     <8cf>   DW_AT_decl_line   : (data1) 87
     <8d0>   DW_AT_decl_column : (data1) 25
     <8d1>   DW_AT_type        : (ref4) <0x1d3b>, PyInterpreterState, _is
     <8d5>   DW_AT_data_member_location: (data1) 16
  <2><8d6>: Abbrev Number: 15 (DW_TAG_member)
-    <8d7>   DW_AT_name        : (strp) (offset: 0x18cb): _initialized
+    <8d7>   DW_AT_name        : (strp) (offset: 0x19ba): _initialized
     <8db>   DW_AT_decl_file   : (data1) 20
     <8dc>   DW_AT_decl_line   : (data1) 93
     <8dd>   DW_AT_decl_column : (data1) 9
     <8de>   DW_AT_type        : (ref4) <0x4f>, int
     <8e2>   DW_AT_data_member_location: (data1) 24
  <2><8e3>: Abbrev Number: 15 (DW_TAG_member)
-    <8e4>   DW_AT_name        : (strp) (offset: 0x1d64): _static
+    <8e4>   DW_AT_name        : (strp) (offset: 0x1e6b): _static
     <8e8>   DW_AT_decl_file   : (data1) 20
     <8e9>   DW_AT_decl_line   : (data1) 96
     <8ea>   DW_AT_decl_column : (data1) 9
     <8eb>   DW_AT_type        : (ref4) <0x4f>, int
     <8ef>   DW_AT_data_member_location: (data1) 28
  <2><8f0>: Abbrev Number: 15 (DW_TAG_member)
-    <8f1>   DW_AT_name        : (strp) (offset: 0x63f): recursion_remaining
+    <8f1>   DW_AT_name        : (strp) (offset: 0x699): recursion_remaining
     <8f5>   DW_AT_decl_file   : (data1) 20
     <8f6>   DW_AT_decl_line   : (data1) 98
     <8f7>   DW_AT_decl_column : (data1) 9
     <8f8>   DW_AT_type        : (ref4) <0x4f>, int
     <8fc>   DW_AT_data_member_location: (data1) 32
  <2><8fd>: Abbrev Number: 15 (DW_TAG_member)
-    <8fe>   DW_AT_name        : (strp) (offset: 0x218f): recursion_limit
+    <8fe>   DW_AT_name        : (strp) (offset: 0x22b3): recursion_limit
     <902>   DW_AT_decl_file   : (data1) 20
     <903>   DW_AT_decl_line   : (data1) 99
     <904>   DW_AT_decl_column : (data1) 9
     <905>   DW_AT_type        : (ref4) <0x4f>, int
     <909>   DW_AT_data_member_location: (data1) 36
  <2><90a>: Abbrev Number: 15 (DW_TAG_member)
-    <90b>   DW_AT_name        : (strp) (offset: 0x23c): recursion_headroom
+    <90b>   DW_AT_name        : (strp) (offset: 0x24b): recursion_headroom
     <90f>   DW_AT_decl_file   : (data1) 20
     <910>   DW_AT_decl_line   : (data1) 100
     <911>   DW_AT_decl_column : (data1) 9
     <912>   DW_AT_type        : (ref4) <0x4f>, int
     <916>   DW_AT_data_member_location: (data1) 40
  <2><917>: Abbrev Number: 15 (DW_TAG_member)
-    <918>   DW_AT_name        : (strp) (offset: 0x15fa): tracing
+    <918>   DW_AT_name        : (strp) (offset: 0x16d4): tracing
     <91c>   DW_AT_decl_file   : (data1) 20
     <91d>   DW_AT_decl_line   : (data1) 105
     <91e>   DW_AT_decl_column : (data1) 9
     <91f>   DW_AT_type        : (ref4) <0x4f>, int
     <923>   DW_AT_data_member_location: (data1) 44
  <2><924>: Abbrev Number: 15 (DW_TAG_member)
-    <925>   DW_AT_name        : (strp) (offset: 0x1fc7): tracing_what
+    <925>   DW_AT_name        : (strp) (offset: 0x20eb): tracing_what
     <929>   DW_AT_decl_file   : (data1) 20
     <92a>   DW_AT_decl_line   : (data1) 106
     <92b>   DW_AT_decl_column : (data1) 9
     <92c>   DW_AT_type        : (ref4) <0x4f>, int
     <930>   DW_AT_data_member_location: (data1) 48
  <2><931>: Abbrev Number: 15 (DW_TAG_member)
-    <932>   DW_AT_name        : (strp) (offset: 0x13c2): cframe
+    <932>   DW_AT_name        : (strp) (offset: 0x1484): cframe
     <936>   DW_AT_decl_file   : (data1) 20
     <937>   DW_AT_decl_line   : (data1) 110
     <938>   DW_AT_decl_column : (data1) 16
     <939>   DW_AT_type        : (ref4) <0x1d41>, _PyCFrame, _PyCFrame
     <93d>   DW_AT_data_member_location: (data1) 56
  <2><93e>: Abbrev Number: 15 (DW_TAG_member)
-    <93f>   DW_AT_name        : (strp) (offset: 0xc7b): c_profilefunc
+    <93f>   DW_AT_name        : (strp) (offset: 0xd36): c_profilefunc
     <943>   DW_AT_decl_file   : (data1) 20
     <944>   DW_AT_decl_line   : (data1) 112
     <945>   DW_AT_decl_column : (data1) 18
     <946>   DW_AT_type        : (ref4) <0x1bef>, Py_tracefunc, int
     <94a>   DW_AT_data_member_location: (data1) 64
  <2><94b>: Abbrev Number: 15 (DW_TAG_member)
-    <94c>   DW_AT_name        : (strp) (offset: 0x1314): c_tracefunc
+    <94c>   DW_AT_name        : (strp) (offset: 0x13e5): c_tracefunc
     <950>   DW_AT_decl_file   : (data1) 20
     <951>   DW_AT_decl_line   : (data1) 113
     <952>   DW_AT_decl_column : (data1) 18
     <953>   DW_AT_type        : (ref4) <0x1bef>, Py_tracefunc, int
     <957>   DW_AT_data_member_location: (data1) 72
  <2><958>: Abbrev Number: 15 (DW_TAG_member)
-    <959>   DW_AT_name        : (strp) (offset: 0x13f1): c_profileobj
+    <959>   DW_AT_name        : (strp) (offset: 0x14b3): c_profileobj
     <95d>   DW_AT_decl_file   : (data1) 20
     <95e>   DW_AT_decl_line   : (data1) 114
     <95f>   DW_AT_decl_column : (data1) 15
     <960>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <964>   DW_AT_data_member_location: (data1) 80
  <2><965>: Abbrev Number: 15 (DW_TAG_member)
-    <966>   DW_AT_name        : (strp) (offset: 0x153e): c_traceobj
+    <966>   DW_AT_name        : (strp) (offset: 0x1608): c_traceobj
     <96a>   DW_AT_decl_file   : (data1) 20
     <96b>   DW_AT_decl_line   : (data1) 115
     <96c>   DW_AT_decl_column : (data1) 15
     <96d>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <971>   DW_AT_data_member_location: (data1) 88
  <2><972>: Abbrev Number: 15 (DW_TAG_member)
-    <973>   DW_AT_name        : (strp) (offset: 0x6ec): curexc_type
+    <973>   DW_AT_name        : (strp) (offset: 0x765): curexc_type
     <977>   DW_AT_decl_file   : (data1) 20
     <978>   DW_AT_decl_line   : (data1) 118
     <979>   DW_AT_decl_column : (data1) 15
     <97a>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <97e>   DW_AT_data_member_location: (data1) 96
  <2><97f>: Abbrev Number: 15 (DW_TAG_member)
-    <980>   DW_AT_name        : (strp) (offset: 0xb12): curexc_value
+    <980>   DW_AT_name        : (strp) (offset: 0xbf2): curexc_value
     <984>   DW_AT_decl_file   : (data1) 20
     <985>   DW_AT_decl_line   : (data1) 119
     <986>   DW_AT_decl_column : (data1) 15
     <987>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <98b>   DW_AT_data_member_location: (data1) 104
  <2><98c>: Abbrev Number: 15 (DW_TAG_member)
-    <98d>   DW_AT_name        : (strp) (offset: 0xa31): curexc_traceback
+    <98d>   DW_AT_name        : (strp) (offset: 0xb11): curexc_traceback
     <991>   DW_AT_decl_file   : (data1) 20
     <992>   DW_AT_decl_line   : (data1) 120
     <993>   DW_AT_decl_column : (data1) 15
     <994>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <998>   DW_AT_data_member_location: (data1) 112
  <2><999>: Abbrev Number: 15 (DW_TAG_member)
-    <99a>   DW_AT_name        : (strp) (offset: 0x10f9): exc_info
+    <99a>   DW_AT_name        : (strp) (offset: 0x11ca): exc_info
     <99e>   DW_AT_decl_file   : (data1) 20
     <99f>   DW_AT_decl_line   : (data1) 125
     <9a0>   DW_AT_decl_column : (data1) 23
     <9a1>   DW_AT_type        : (ref4) <0x1d47>, _PyErr_StackItem, _err_stackitem
     <9a5>   DW_AT_data_member_location: (data1) 120
  <2><9a6>: Abbrev Number: 15 (DW_TAG_member)
-    <9a7>   DW_AT_name        : (strp) (offset: 0xcf0): dict
+    <9a7>   DW_AT_name        : (strp) (offset: 0xdab): dict
     <9ab>   DW_AT_decl_file   : (data1) 20
     <9ac>   DW_AT_decl_line   : (data1) 127
     <9ad>   DW_AT_decl_column : (data1) 15
     <9ae>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <9b2>   DW_AT_data_member_location: (data1) 128
  <2><9b3>: Abbrev Number: 15 (DW_TAG_member)
-    <9b4>   DW_AT_name        : (strp) (offset: 0x68d): gilstate_counter
+    <9b4>   DW_AT_name        : (strp) (offset: 0x706): gilstate_counter
     <9b8>   DW_AT_decl_file   : (data1) 20
     <9b9>   DW_AT_decl_line   : (data1) 129
     <9ba>   DW_AT_decl_column : (data1) 9
     <9bb>   DW_AT_type        : (ref4) <0x4f>, int
     <9bf>   DW_AT_data_member_location: (data1) 136
  <2><9c0>: Abbrev Number: 15 (DW_TAG_member)
-    <9c1>   DW_AT_name        : (strp) (offset: 0x1f53): async_exc
+    <9c1>   DW_AT_name        : (strp) (offset: 0x2077): async_exc
     <9c5>   DW_AT_decl_file   : (data1) 20
     <9c6>   DW_AT_decl_line   : (data1) 131
     <9c7>   DW_AT_decl_column : (data1) 15
     <9c8>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <9cc>   DW_AT_data_member_location: (data1) 144
  <2><9cd>: Abbrev Number: 15 (DW_TAG_member)
-    <9ce>   DW_AT_name        : (strp) (offset: 0x117f): thread_id
+    <9ce>   DW_AT_name        : (strp) (offset: 0x1250): thread_id
     <9d2>   DW_AT_decl_file   : (data1) 20
     <9d3>   DW_AT_decl_line   : (data1) 132
     <9d4>   DW_AT_decl_column : (data1) 19
     <9d5>   DW_AT_type        : (ref4) <0x62>, long unsigned int
     <9d9>   DW_AT_data_member_location: (data1) 152
  <2><9da>: Abbrev Number: 15 (DW_TAG_member)
-    <9db>   DW_AT_name        : (strp) (offset: 0x1178): native_thread_id
+    <9db>   DW_AT_name        : (strp) (offset: 0x1249): native_thread_id
     <9df>   DW_AT_decl_file   : (data1) 20
     <9e0>   DW_AT_decl_line   : (data1) 138
     <9e1>   DW_AT_decl_column : (data1) 19
     <9e2>   DW_AT_type        : (ref4) <0x62>, long unsigned int
     <9e6>   DW_AT_data_member_location: (data1) 160
  <2><9e7>: Abbrev Number: 15 (DW_TAG_member)
-    <9e8>   DW_AT_name        : (strp) (offset: 0x21c9): trash_delete_nesting
+    <9e8>   DW_AT_name        : (strp) (offset: 0x22ed): trash_delete_nesting
     <9ec>   DW_AT_decl_file   : (data1) 20
     <9ed>   DW_AT_decl_line   : (data1) 140
     <9ee>   DW_AT_decl_column : (data1) 9
     <9ef>   DW_AT_type        : (ref4) <0x4f>, int
     <9f3>   DW_AT_data_member_location: (data1) 168
  <2><9f4>: Abbrev Number: 15 (DW_TAG_member)
-    <9f5>   DW_AT_name        : (strp) (offset: 0x1c6c): trash_delete_later
+    <9f5>   DW_AT_name        : (strp) (offset: 0x1d60): trash_delete_later
     <9f9>   DW_AT_decl_file   : (data1) 20
     <9fa>   DW_AT_decl_line   : (data1) 141
     <9fb>   DW_AT_decl_column : (data1) 15
     <9fc>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <a00>   DW_AT_data_member_location: (data1) 176
  <2><a01>: Abbrev Number: 15 (DW_TAG_member)
-    <a02>   DW_AT_name        : (strp) (offset: 0x1dfd): on_delete
+    <a02>   DW_AT_name        : (strp) (offset: 0x1f21): on_delete
     <a06>   DW_AT_decl_file   : (data1) 20
     <a07>   DW_AT_decl_line   : (data1) 166
     <a08>   DW_AT_decl_column : (data1) 12
     <a09>   DW_AT_type        : (ref4) <0xd6c>
     <a0d>   DW_AT_data_member_location: (data1) 184
  <2><a0e>: Abbrev Number: 15 (DW_TAG_member)
     <a0f>   DW_AT_name        : (strp) (offset: 0xd8): on_delete_data
     <a13>   DW_AT_decl_file   : (data1) 20
     <a14>   DW_AT_decl_line   : (data1) 167
     <a15>   DW_AT_decl_column : (data1) 11
     <a16>   DW_AT_type        : (ref4) <0x88>
     <a1a>   DW_AT_data_member_location: (data1) 192
  <2><a1b>: Abbrev Number: 15 (DW_TAG_member)
-    <a1c>   DW_AT_name        : (strp) (offset: 0x2129): coroutine_origin_tracking_depth
+    <a1c>   DW_AT_name        : (strp) (offset: 0x224d): coroutine_origin_tracking_depth
     <a20>   DW_AT_decl_file   : (data1) 20
     <a21>   DW_AT_decl_line   : (data1) 169
     <a22>   DW_AT_decl_column : (data1) 9
     <a23>   DW_AT_type        : (ref4) <0x4f>, int
     <a27>   DW_AT_data_member_location: (data1) 200
  <2><a28>: Abbrev Number: 15 (DW_TAG_member)
-    <a29>   DW_AT_name        : (strp) (offset: 0x1f04): async_gen_firstiter
+    <a29>   DW_AT_name        : (strp) (offset: 0x2028): async_gen_firstiter
     <a2d>   DW_AT_decl_file   : (data1) 20
     <a2e>   DW_AT_decl_line   : (data1) 171
     <a2f>   DW_AT_decl_column : (data1) 15
     <a30>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <a34>   DW_AT_data_member_location: (data1) 208
  <2><a35>: Abbrev Number: 15 (DW_TAG_member)
-    <a36>   DW_AT_name        : (strp) (offset: 0xe23): async_gen_finalizer
+    <a36>   DW_AT_name        : (strp) (offset: 0xeea): async_gen_finalizer
     <a3a>   DW_AT_decl_file   : (data1) 20
     <a3b>   DW_AT_decl_line   : (data1) 172
     <a3c>   DW_AT_decl_column : (data1) 15
     <a3d>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <a41>   DW_AT_data_member_location: (data1) 216
  <2><a42>: Abbrev Number: 15 (DW_TAG_member)
-    <a43>   DW_AT_name        : (strp) (offset: 0x774): context
+    <a43>   DW_AT_name        : (strp) (offset: 0x7ed): context
     <a47>   DW_AT_decl_file   : (data1) 20
     <a48>   DW_AT_decl_line   : (data1) 174
     <a49>   DW_AT_decl_column : (data1) 15
     <a4a>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <a4e>   DW_AT_data_member_location: (data1) 224
  <2><a4f>: Abbrev Number: 15 (DW_TAG_member)
-    <a50>   DW_AT_name        : (strp) (offset: 0x1967): context_ver
+    <a50>   DW_AT_name        : (strp) (offset: 0x1a5b): context_ver
     <a54>   DW_AT_decl_file   : (data1) 20
     <a55>   DW_AT_decl_line   : (data1) 175
     <a56>   DW_AT_decl_column : (data1) 14
     <a57>   DW_AT_type        : (ref4) <0x19f>, uint64_t, long unsigned int
     <a5b>   DW_AT_data_member_location: (data1) 232
  <2><a5c>: Abbrev Number: 16 (DW_TAG_member)
     <a5d>   DW_AT_name        : (string) id
     <a60>   DW_AT_decl_file   : (data1) 20
     <a61>   DW_AT_decl_line   : (data1) 178
     <a62>   DW_AT_decl_column : (data1) 14
     <a63>   DW_AT_type        : (ref4) <0x19f>, uint64_t, long unsigned int
     <a67>   DW_AT_data_member_location: (data1) 240
  <2><a68>: Abbrev Number: 15 (DW_TAG_member)
-    <a69>   DW_AT_name        : (strp) (offset: 0x2252): trace_info
+    <a69>   DW_AT_name        : (strp) (offset: 0x238a): trace_info
     <a6d>   DW_AT_decl_file   : (data1) 20
     <a6e>   DW_AT_decl_line   : (data1) 180
     <a6f>   DW_AT_decl_column : (data1) 17
     <a70>   DW_AT_type        : (ref4) <0x1c49>, PyTraceInfo
     <a74>   DW_AT_data_member_location: (data1) 248
  <2><a75>: Abbrev Number: 18 (DW_TAG_member)
-    <a76>   DW_AT_name        : (strp) (offset: 0x1320): datastack_chunk
+    <a76>   DW_AT_name        : (strp) (offset: 0x13f1): datastack_chunk
     <a7a>   DW_AT_decl_file   : (data1) 20
     <a7b>   DW_AT_decl_line   : (data1) 182
     <a7c>   DW_AT_decl_column : (data1) 20
     <a7d>   DW_AT_type        : (ref4) <0x1d4d>, _PyStackChunk, _stack_chunk
     <a81>   DW_AT_data_member_location: (data2) 296
  <2><a83>: Abbrev Number: 18 (DW_TAG_member)
-    <a84>   DW_AT_name        : (strp) (offset: 0x603): datastack_top
+    <a84>   DW_AT_name        : (strp) (offset: 0x65d): datastack_top
     <a88>   DW_AT_decl_file   : (data1) 20
     <a89>   DW_AT_decl_line   : (data1) 183
     <a8a>   DW_AT_decl_column : (data1) 16
     <a8b>   DW_AT_type        : (ref4) <0x135d>, PyObject, _object
     <a8f>   DW_AT_data_member_location: (data2) 304
  <2><a91>: Abbrev Number: 18 (DW_TAG_member)
-    <a92>   DW_AT_name        : (strp) (offset: 0x1f38): datastack_limit
+    <a92>   DW_AT_name        : (strp) (offset: 0x205c): datastack_limit
     <a96>   DW_AT_decl_file   : (data1) 20
     <a97>   DW_AT_decl_line   : (data1) 184
     <a98>   DW_AT_decl_column : (data1) 16
     <a99>   DW_AT_type        : (ref4) <0x135d>, PyObject, _object
     <a9d>   DW_AT_data_member_location: (data2) 312
  <2><a9f>: Abbrev Number: 18 (DW_TAG_member)
-    <aa0>   DW_AT_name        : (strp) (offset: 0x598): exc_state
+    <aa0>   DW_AT_name        : (strp) (offset: 0x5f2): exc_state
     <aa4>   DW_AT_decl_file   : (data1) 20
     <aa5>   DW_AT_decl_line   : (data1) 199
     <aa6>   DW_AT_decl_column : (data1) 22
     <aa7>   DW_AT_type        : (ref4) <0x1cd5>, _PyErr_StackItem, _err_stackitem
     <aab>   DW_AT_data_member_location: (data2) 320
  <2><aad>: Abbrev Number: 18 (DW_TAG_member)
-    <aae>   DW_AT_name        : (strp) (offset: 0x13bd): root_cframe
+    <aae>   DW_AT_name        : (strp) (offset: 0x147f): root_cframe
     <ab2>   DW_AT_decl_file   : (data1) 20
     <ab3>   DW_AT_decl_line   : (data1) 202
     <ab4>   DW_AT_decl_column : (data1) 15
     <ab5>   DW_AT_type        : (ref4) <0x1c9b>, _PyCFrame, _PyCFrame
     <ab9>   DW_AT_data_member_location: (data2) 336
  <2><abb>: Abbrev Number: 0
  <1><abc>: Abbrev Number: 3 (DW_TAG_typedef)
@@ -1498,64 +1498,64 @@
     <af1>   DW_AT_name        : (string) len
     <af5>   DW_AT_decl_file   : (data1) 21
     <af6>   DW_AT_decl_line   : (data1) 23
     <af7>   DW_AT_decl_column : (data1) 16
     <af8>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
     <afc>   DW_AT_data_member_location: (data1) 16
  <2><afd>: Abbrev Number: 15 (DW_TAG_member)
-    <afe>   DW_AT_name        : (strp) (offset: 0x1e69): itemsize
+    <afe>   DW_AT_name        : (strp) (offset: 0x1f8d): itemsize
     <b02>   DW_AT_decl_file   : (data1) 21
     <b03>   DW_AT_decl_line   : (data1) 24
     <b04>   DW_AT_decl_column : (data1) 16
     <b05>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
     <b09>   DW_AT_data_member_location: (data1) 24
  <2><b0a>: Abbrev Number: 15 (DW_TAG_member)
-    <b0b>   DW_AT_name        : (strp) (offset: 0x1155): readonly
+    <b0b>   DW_AT_name        : (strp) (offset: 0x1226): readonly
     <b0f>   DW_AT_decl_file   : (data1) 21
     <b10>   DW_AT_decl_line   : (data1) 26
     <b11>   DW_AT_decl_column : (data1) 9
     <b12>   DW_AT_type        : (ref4) <0x4f>, int
     <b16>   DW_AT_data_member_location: (data1) 32
  <2><b17>: Abbrev Number: 15 (DW_TAG_member)
-    <b18>   DW_AT_name        : (strp) (offset: 0x9b2): ndim
+    <b18>   DW_AT_name        : (strp) (offset: 0xa92): ndim
     <b1c>   DW_AT_decl_file   : (data1) 21
     <b1d>   DW_AT_decl_line   : (data1) 27
     <b1e>   DW_AT_decl_column : (data1) 9
     <b1f>   DW_AT_type        : (ref4) <0x4f>, int
     <b23>   DW_AT_data_member_location: (data1) 36
  <2><b24>: Abbrev Number: 15 (DW_TAG_member)
-    <b25>   DW_AT_name        : (strp) (offset: 0xf69): format
+    <b25>   DW_AT_name        : (strp) (offset: 0x1030): format
     <b29>   DW_AT_decl_file   : (data1) 21
     <b2a>   DW_AT_decl_line   : (data1) 28
     <b2b>   DW_AT_decl_column : (data1) 11
     <b2c>   DW_AT_type        : (ref4) <0xea>, char
     <b30>   DW_AT_data_member_location: (data1) 40
  <2><b31>: Abbrev Number: 15 (DW_TAG_member)
-    <b32>   DW_AT_name        : (strp) (offset: 0x20b3): shape
+    <b32>   DW_AT_name        : (strp) (offset: 0x21d7): shape
     <b36>   DW_AT_decl_file   : (data1) 21
     <b37>   DW_AT_decl_line   : (data1) 29
     <b38>   DW_AT_decl_column : (data1) 17
     <b39>   DW_AT_type        : (ref4) <0xb71>, Py_ssize_t, ssize_t, long int
     <b3d>   DW_AT_data_member_location: (data1) 48
  <2><b3e>: Abbrev Number: 15 (DW_TAG_member)
-    <b3f>   DW_AT_name        : (strp) (offset: 0x24f): strides
+    <b3f>   DW_AT_name        : (strp) (offset: 0x25e): strides
     <b43>   DW_AT_decl_file   : (data1) 21
     <b44>   DW_AT_decl_line   : (data1) 30
     <b45>   DW_AT_decl_column : (data1) 17
     <b46>   DW_AT_type        : (ref4) <0xb71>, Py_ssize_t, ssize_t, long int
     <b4a>   DW_AT_data_member_location: (data1) 56
  <2><b4b>: Abbrev Number: 15 (DW_TAG_member)
-    <b4c>   DW_AT_name        : (strp) (offset: 0x151d): suboffsets
+    <b4c>   DW_AT_name        : (strp) (offset: 0x15e7): suboffsets
     <b50>   DW_AT_decl_file   : (data1) 21
     <b51>   DW_AT_decl_line   : (data1) 31
     <b52>   DW_AT_decl_column : (data1) 17
     <b53>   DW_AT_type        : (ref4) <0xb71>, Py_ssize_t, ssize_t, long int
     <b57>   DW_AT_data_member_location: (data1) 64
  <2><b58>: Abbrev Number: 15 (DW_TAG_member)
-    <b59>   DW_AT_name        : (strp) (offset: 0x13b4): internal
+    <b59>   DW_AT_name        : (strp) (offset: 0x1476): internal
     <b5d>   DW_AT_decl_file   : (data1) 21
     <b5e>   DW_AT_decl_line   : (data1) 32
     <b5f>   DW_AT_decl_column : (data1) 11
     <b60>   DW_AT_type        : (ref4) <0x88>
     <b64>   DW_AT_data_member_location: (data1) 72
  <2><b65>: Abbrev Number: 0
  <1><b66>: Abbrev Number: 10 (DW_TAG_pointer_type)
@@ -1563,51 +1563,51 @@
     <b68>   DW_AT_type        : (ref4) <0x3de>, PyObject, _object
  <1><b6c>: Abbrev Number: 5 (DW_TAG_const_type)
     <b6d>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <1><b71>: Abbrev Number: 10 (DW_TAG_pointer_type)
     <b72>   DW_AT_byte_size   : (data1) 8
     <b73>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
  <1><b77>: Abbrev Number: 3 (DW_TAG_typedef)
-    <b78>   DW_AT_name        : (strp) (offset: 0x89a): Py_buffer
+    <b78>   DW_AT_name        : (strp) (offset: 0x97a): Py_buffer
     <b7c>   DW_AT_decl_file   : (data1) 21
     <b7d>   DW_AT_decl_line   : (data1) 33
     <b7e>   DW_AT_decl_column : (data1) 3
     <b7f>   DW_AT_type        : (ref4) <0xacd>
  <1><b83>: Abbrev Number: 10 (DW_TAG_pointer_type)
     <b84>   DW_AT_byte_size   : (data1) 8
     <b85>   DW_AT_type        : (ref4) <0x446>, PyTypeObject, _typeobject
  <1><b89>: Abbrev Number: 21 (DW_TAG_structure_type)
     <b8a>   DW_AT_byte_size   : (data1) 24
     <b8b>   DW_AT_decl_file   : (data1) 2
     <b8c>   DW_AT_decl_line   : (data1) 109
     <b8d>   DW_AT_decl_column : (data1) 9
     <b8e>   DW_AT_sibling     : (ref4) <0xbad>
  <2><b92>: Abbrev Number: 15 (DW_TAG_member)
-    <b93>   DW_AT_name        : (strp) (offset: 0x397): ob_base
+    <b93>   DW_AT_name        : (strp) (offset: 0x3dd): ob_base
     <b97>   DW_AT_decl_file   : (data1) 2
     <b98>   DW_AT_decl_line   : (data1) 110
     <b99>   DW_AT_decl_column : (data1) 14
     <b9a>   DW_AT_type        : (ref4) <0x3de>, PyObject, _object
     <b9e>   DW_AT_data_member_location: (data1) 0
  <2><b9f>: Abbrev Number: 15 (DW_TAG_member)
-    <ba0>   DW_AT_name        : (strp) (offset: 0x13fe): ob_size
+    <ba0>   DW_AT_name        : (strp) (offset: 0x14c0): ob_size
     <ba4>   DW_AT_decl_file   : (data1) 2
     <ba5>   DW_AT_decl_line   : (data1) 111
     <ba6>   DW_AT_decl_column : (data1) 16
     <ba7>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
     <bab>   DW_AT_data_member_location: (data1) 16
  <2><bac>: Abbrev Number: 0
  <1><bad>: Abbrev Number: 3 (DW_TAG_typedef)
-    <bae>   DW_AT_name        : (strp) (offset: 0xba5): PyVarObject
+    <bae>   DW_AT_name        : (strp) (offset: 0xc94): PyVarObject
     <bb2>   DW_AT_decl_file   : (data1) 2
     <bb3>   DW_AT_decl_line   : (data1) 112
     <bb4>   DW_AT_decl_column : (data1) 3
     <bb5>   DW_AT_type        : (ref4) <0xb89>
  <1><bb9>: Abbrev Number: 3 (DW_TAG_typedef)
-    <bba>   DW_AT_name        : (strp) (offset: 0xd50): unaryfunc
+    <bba>   DW_AT_name        : (strp) (offset: 0xe17): unaryfunc
     <bbe>   DW_AT_decl_file   : (data1) 2
     <bbf>   DW_AT_decl_line   : (data1) 196
     <bc0>   DW_AT_decl_column : (data1) 22
     <bc1>   DW_AT_type        : (ref4) <0xbc5>, PyObject, _object
  <1><bc5>: Abbrev Number: 10 (DW_TAG_pointer_type)
     <bc6>   DW_AT_byte_size   : (data1) 8
     <bc7>   DW_AT_type        : (ref4) <0xbcb>, PyObject, _object
@@ -1615,15 +1615,15 @@
     <bcc>   DW_AT_prototyped  : (flag_present) 1
     <bcc>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
     <bd0>   DW_AT_sibling     : (ref4) <0xbda>
  <2><bd4>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <bd5>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><bd9>: Abbrev Number: 0
  <1><bda>: Abbrev Number: 3 (DW_TAG_typedef)
-    <bdb>   DW_AT_name        : (strp) (offset: 0x1d98): binaryfunc
+    <bdb>   DW_AT_name        : (strp) (offset: 0x1ebc): binaryfunc
     <bdf>   DW_AT_decl_file   : (data1) 2
     <be0>   DW_AT_decl_line   : (data1) 197
     <be1>   DW_AT_decl_column : (data1) 22
     <be2>   DW_AT_type        : (ref4) <0xbe6>, PyObject, _object
  <1><be6>: Abbrev Number: 10 (DW_TAG_pointer_type)
     <be7>   DW_AT_byte_size   : (data1) 8
     <be8>   DW_AT_type        : (ref4) <0xbec>, PyObject, _object
@@ -1633,15 +1633,15 @@
     <bf1>   DW_AT_sibling     : (ref4) <0xc00>
  <2><bf5>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <bf6>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><bfa>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <bfb>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><bff>: Abbrev Number: 0
  <1><c00>: Abbrev Number: 3 (DW_TAG_typedef)
-    <c01>   DW_AT_name        : (strp) (offset: 0x541): ternaryfunc
+    <c01>   DW_AT_name        : (strp) (offset: 0x59b): ternaryfunc
     <c05>   DW_AT_decl_file   : (data1) 2
     <c06>   DW_AT_decl_line   : (data1) 198
     <c07>   DW_AT_decl_column : (data1) 22
     <c08>   DW_AT_type        : (ref4) <0xc0c>, PyObject, _object
  <1><c0c>: Abbrev Number: 10 (DW_TAG_pointer_type)
     <c0d>   DW_AT_byte_size   : (data1) 8
     <c0e>   DW_AT_type        : (ref4) <0xc12>, PyObject, _object
@@ -1653,15 +1653,15 @@
     <c1c>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><c20>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <c21>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><c25>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <c26>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><c2a>: Abbrev Number: 0
  <1><c2b>: Abbrev Number: 3 (DW_TAG_typedef)
-    <c2c>   DW_AT_name        : (strp) (offset: 0x14e2): inquiry
+    <c2c>   DW_AT_name        : (strp) (offset: 0x15ac): inquiry
     <c30>   DW_AT_decl_file   : (data1) 2
     <c31>   DW_AT_decl_line   : (data1) 199
     <c32>   DW_AT_decl_column : (data1) 15
     <c33>   DW_AT_type        : (ref4) <0xc37>, int
  <1><c37>: Abbrev Number: 10 (DW_TAG_pointer_type)
     <c38>   DW_AT_byte_size   : (data1) 8
     <c39>   DW_AT_type        : (ref4) <0xc3d>, int
@@ -1669,15 +1669,15 @@
     <c3e>   DW_AT_prototyped  : (flag_present) 1
     <c3e>   DW_AT_type        : (ref4) <0x4f>, int
     <c42>   DW_AT_sibling     : (ref4) <0xc4c>
  <2><c46>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <c47>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><c4b>: Abbrev Number: 0
  <1><c4c>: Abbrev Number: 3 (DW_TAG_typedef)
-    <c4d>   DW_AT_name        : (strp) (offset: 0xc73): lenfunc
+    <c4d>   DW_AT_name        : (strp) (offset: 0xd2e): lenfunc
     <c51>   DW_AT_decl_file   : (data1) 2
     <c52>   DW_AT_decl_line   : (data1) 200
     <c53>   DW_AT_decl_column : (data1) 22
     <c54>   DW_AT_type        : (ref4) <0xc58>, Py_ssize_t, ssize_t, long int
  <1><c58>: Abbrev Number: 10 (DW_TAG_pointer_type)
     <c59>   DW_AT_byte_size   : (data1) 8
     <c5a>   DW_AT_type        : (ref4) <0xc5e>, Py_ssize_t, ssize_t, long int
@@ -1685,15 +1685,15 @@
     <c5f>   DW_AT_prototyped  : (flag_present) 1
     <c5f>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
     <c63>   DW_AT_sibling     : (ref4) <0xc6d>
  <2><c67>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <c68>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><c6c>: Abbrev Number: 0
  <1><c6d>: Abbrev Number: 3 (DW_TAG_typedef)
-    <c6e>   DW_AT_name        : (strp) (offset: 0x1249): ssizeargfunc
+    <c6e>   DW_AT_name        : (strp) (offset: 0x131a): ssizeargfunc
     <c72>   DW_AT_decl_file   : (data1) 2
     <c73>   DW_AT_decl_line   : (data1) 201
     <c74>   DW_AT_decl_column : (data1) 21
     <c75>   DW_AT_type        : (ref4) <0xc79>, PyObject, _object
  <1><c79>: Abbrev Number: 10 (DW_TAG_pointer_type)
     <c7a>   DW_AT_byte_size   : (data1) 8
     <c7b>   DW_AT_type        : (ref4) <0xc7f>, PyObject, _object
@@ -1703,15 +1703,15 @@
     <c84>   DW_AT_sibling     : (ref4) <0xc93>
  <2><c88>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <c89>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><c8d>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <c8e>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
  <2><c92>: Abbrev Number: 0
  <1><c93>: Abbrev Number: 3 (DW_TAG_typedef)
-    <c94>   DW_AT_name        : (strp) (offset: 0x22c): ssizeobjargproc
+    <c94>   DW_AT_name        : (strp) (offset: 0x23b): ssizeobjargproc
     <c98>   DW_AT_decl_file   : (data1) 2
     <c99>   DW_AT_decl_line   : (data1) 203
     <c9a>   DW_AT_decl_column : (data1) 14
     <c9b>   DW_AT_type        : (ref4) <0xc9f>, int
  <1><c9f>: Abbrev Number: 10 (DW_TAG_pointer_type)
     <ca0>   DW_AT_byte_size   : (data1) 8
     <ca1>   DW_AT_type        : (ref4) <0xca5>, int
@@ -1723,15 +1723,15 @@
     <caf>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><cb3>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <cb4>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
  <2><cb8>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <cb9>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><cbd>: Abbrev Number: 0
  <1><cbe>: Abbrev Number: 3 (DW_TAG_typedef)
-    <cbf>   DW_AT_name        : (strp) (offset: 0x1c17): objobjargproc
+    <cbf>   DW_AT_name        : (strp) (offset: 0x1d0b): objobjargproc
     <cc3>   DW_AT_decl_file   : (data1) 2
     <cc4>   DW_AT_decl_line   : (data1) 205
     <cc5>   DW_AT_decl_column : (data1) 14
     <cc6>   DW_AT_type        : (ref4) <0xcca>, int
  <1><cca>: Abbrev Number: 10 (DW_TAG_pointer_type)
     <ccb>   DW_AT_byte_size   : (data1) 8
     <ccc>   DW_AT_type        : (ref4) <0xcd0>, int
@@ -1743,15 +1743,15 @@
     <cda>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><cde>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <cdf>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><ce3>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <ce4>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><ce8>: Abbrev Number: 0
  <1><ce9>: Abbrev Number: 3 (DW_TAG_typedef)
-    <cea>   DW_AT_name        : (strp) (offset: 0x2326): objobjproc
+    <cea>   DW_AT_name        : (strp) (offset: 0x245e): objobjproc
     <cee>   DW_AT_decl_file   : (data1) 2
     <cef>   DW_AT_decl_line   : (data1) 207
     <cf0>   DW_AT_decl_column : (data1) 15
     <cf1>   DW_AT_type        : (ref4) <0xcf5>, int
  <1><cf5>: Abbrev Number: 10 (DW_TAG_pointer_type)
     <cf6>   DW_AT_byte_size   : (data1) 8
     <cf7>   DW_AT_type        : (ref4) <0xcfb>, int
@@ -1761,15 +1761,15 @@
     <d00>   DW_AT_sibling     : (ref4) <0xd0f>
  <2><d04>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <d05>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><d09>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <d0a>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><d0e>: Abbrev Number: 0
  <1><d0f>: Abbrev Number: 3 (DW_TAG_typedef)
-    <d10>   DW_AT_name        : (strp) (offset: 0x189b): visitproc
+    <d10>   DW_AT_name        : (strp) (offset: 0x1979): visitproc
     <d14>   DW_AT_decl_file   : (data1) 2
     <d15>   DW_AT_decl_line   : (data1) 208
     <d16>   DW_AT_decl_column : (data1) 15
     <d17>   DW_AT_type        : (ref4) <0xd1b>, int
  <1><d1b>: Abbrev Number: 10 (DW_TAG_pointer_type)
     <d1c>   DW_AT_byte_size   : (data1) 8
     <d1d>   DW_AT_type        : (ref4) <0xd21>, int
@@ -1779,15 +1779,15 @@
     <d26>   DW_AT_sibling     : (ref4) <0xd35>
  <2><d2a>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <d2b>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><d2f>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <d30>   DW_AT_type        : (ref4) <0x88>
  <2><d34>: Abbrev Number: 0
  <1><d35>: Abbrev Number: 3 (DW_TAG_typedef)
-    <d36>   DW_AT_name        : (strp) (offset: 0xe7f): traverseproc
+    <d36>   DW_AT_name        : (strp) (offset: 0xf46): traverseproc
     <d3a>   DW_AT_decl_file   : (data1) 2
     <d3b>   DW_AT_decl_line   : (data1) 209
     <d3c>   DW_AT_decl_column : (data1) 15
     <d3d>   DW_AT_type        : (ref4) <0xd41>, int
  <1><d41>: Abbrev Number: 10 (DW_TAG_pointer_type)
     <d42>   DW_AT_byte_size   : (data1) 8
     <d43>   DW_AT_type        : (ref4) <0xd47>, int
@@ -1799,45 +1799,45 @@
     <d51>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><d55>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <d56>   DW_AT_type        : (ref4) <0xd0f>, visitproc, int
  <2><d5a>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <d5b>   DW_AT_type        : (ref4) <0x88>
  <2><d5f>: Abbrev Number: 0
  <1><d60>: Abbrev Number: 3 (DW_TAG_typedef)
-    <d61>   DW_AT_name        : (strp) (offset: 0x1abb): freefunc
+    <d61>   DW_AT_name        : (strp) (offset: 0x1baf): freefunc
     <d65>   DW_AT_decl_file   : (data1) 2
     <d66>   DW_AT_decl_line   : (data1) 212
     <d67>   DW_AT_decl_column : (data1) 16
     <d68>   DW_AT_type        : (ref4) <0xd6c>
  <1><d6c>: Abbrev Number: 10 (DW_TAG_pointer_type)
     <d6d>   DW_AT_byte_size   : (data1) 8
     <d6e>   DW_AT_type        : (ref4) <0xd72>
  <1><d72>: Abbrev Number: 24 (DW_TAG_subroutine_type)
     <d73>   DW_AT_prototyped  : (flag_present) 1
     <d73>   DW_AT_sibling     : (ref4) <0xd7d>
  <2><d77>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <d78>   DW_AT_type        : (ref4) <0x88>
  <2><d7c>: Abbrev Number: 0
  <1><d7d>: Abbrev Number: 3 (DW_TAG_typedef)
-    <d7e>   DW_AT_name        : (strp) (offset: 0x1084): destructor
+    <d7e>   DW_AT_name        : (strp) (offset: 0x1142): destructor
     <d82>   DW_AT_decl_file   : (data1) 2
     <d83>   DW_AT_decl_line   : (data1) 213
     <d84>   DW_AT_decl_column : (data1) 16
     <d85>   DW_AT_type        : (ref4) <0xd89>
  <1><d89>: Abbrev Number: 10 (DW_TAG_pointer_type)
     <d8a>   DW_AT_byte_size   : (data1) 8
     <d8b>   DW_AT_type        : (ref4) <0xd8f>
  <1><d8f>: Abbrev Number: 24 (DW_TAG_subroutine_type)
     <d90>   DW_AT_prototyped  : (flag_present) 1
     <d90>   DW_AT_sibling     : (ref4) <0xd9a>
  <2><d94>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <d95>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><d99>: Abbrev Number: 0
  <1><d9a>: Abbrev Number: 3 (DW_TAG_typedef)
-    <d9b>   DW_AT_name        : (strp) (offset: 0x201f): getattrfunc
+    <d9b>   DW_AT_name        : (strp) (offset: 0x2143): getattrfunc
     <d9f>   DW_AT_decl_file   : (data1) 2
     <da0>   DW_AT_decl_line   : (data1) 214
     <da1>   DW_AT_decl_column : (data1) 21
     <da2>   DW_AT_type        : (ref4) <0xda6>, PyObject, _object
  <1><da6>: Abbrev Number: 10 (DW_TAG_pointer_type)
     <da7>   DW_AT_byte_size   : (data1) 8
     <da8>   DW_AT_type        : (ref4) <0xdac>, PyObject, _object
@@ -1847,21 +1847,21 @@
     <db1>   DW_AT_sibling     : (ref4) <0xdc0>
  <2><db5>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <db6>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><dba>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <dbb>   DW_AT_type        : (ref4) <0xea>, char
  <2><dbf>: Abbrev Number: 0
  <1><dc0>: Abbrev Number: 3 (DW_TAG_typedef)
-    <dc1>   DW_AT_name        : (strp) (offset: 0xb37): getattrofunc
+    <dc1>   DW_AT_name        : (strp) (offset: 0xc26): getattrofunc
     <dc5>   DW_AT_decl_file   : (data1) 2
     <dc6>   DW_AT_decl_line   : (data1) 215
     <dc7>   DW_AT_decl_column : (data1) 21
     <dc8>   DW_AT_type        : (ref4) <0xbe6>, PyObject, _object
  <1><dcc>: Abbrev Number: 3 (DW_TAG_typedef)
-    <dcd>   DW_AT_name        : (strp) (offset: 0x165c): setattrfunc
+    <dcd>   DW_AT_name        : (strp) (offset: 0x1736): setattrfunc
     <dd1>   DW_AT_decl_file   : (data1) 2
     <dd2>   DW_AT_decl_line   : (data1) 216
     <dd3>   DW_AT_decl_column : (data1) 15
     <dd4>   DW_AT_type        : (ref4) <0xdd8>, int
  <1><dd8>: Abbrev Number: 10 (DW_TAG_pointer_type)
     <dd9>   DW_AT_byte_size   : (data1) 8
     <dda>   DW_AT_type        : (ref4) <0xdde>, int
@@ -1873,27 +1873,27 @@
     <de8>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><dec>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <ded>   DW_AT_type        : (ref4) <0xea>, char
  <2><df1>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <df2>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><df6>: Abbrev Number: 0
  <1><df7>: Abbrev Number: 3 (DW_TAG_typedef)
-    <df8>   DW_AT_name        : (strp) (offset: 0x2012): setattrofunc
+    <df8>   DW_AT_name        : (strp) (offset: 0x2136): setattrofunc
     <dfc>   DW_AT_decl_file   : (data1) 2
     <dfd>   DW_AT_decl_line   : (data1) 217
     <dfe>   DW_AT_decl_column : (data1) 15
     <dff>   DW_AT_type        : (ref4) <0xcca>, int
  <1><e03>: Abbrev Number: 3 (DW_TAG_typedef)
-    <e04>   DW_AT_name        : (strp) (offset: 0xbe4): reprfunc
+    <e04>   DW_AT_name        : (strp) (offset: 0xcd3): reprfunc
     <e08>   DW_AT_decl_file   : (data1) 2
     <e09>   DW_AT_decl_line   : (data1) 218
     <e0a>   DW_AT_decl_column : (data1) 21
     <e0b>   DW_AT_type        : (ref4) <0xbc5>, PyObject, _object
  <1><e0f>: Abbrev Number: 3 (DW_TAG_typedef)
-    <e10>   DW_AT_name        : (strp) (offset: 0x16b8): hashfunc
+    <e10>   DW_AT_name        : (strp) (offset: 0x1781): hashfunc
     <e14>   DW_AT_decl_file   : (data1) 2
     <e15>   DW_AT_decl_line   : (data1) 219
     <e16>   DW_AT_decl_column : (data1) 21
     <e17>   DW_AT_type        : (ref4) <0xe1b>, Py_hash_t, Py_ssize_t, ssize_t, long int
  <1><e1b>: Abbrev Number: 10 (DW_TAG_pointer_type)
     <e1c>   DW_AT_byte_size   : (data1) 8
     <e1d>   DW_AT_type        : (ref4) <0xe21>, Py_hash_t, Py_ssize_t, ssize_t, long int
@@ -1901,15 +1901,15 @@
     <e22>   DW_AT_prototyped  : (flag_present) 1
     <e22>   DW_AT_type        : (ref4) <0x1b7>, Py_hash_t, Py_ssize_t, ssize_t, long int
     <e26>   DW_AT_sibling     : (ref4) <0xe30>
  <2><e2a>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <e2b>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><e2f>: Abbrev Number: 0
  <1><e30>: Abbrev Number: 3 (DW_TAG_typedef)
-    <e31>   DW_AT_name        : (strp) (offset: 0x1c54): richcmpfunc
+    <e31>   DW_AT_name        : (strp) (offset: 0x1d48): richcmpfunc
     <e35>   DW_AT_decl_file   : (data1) 2
     <e36>   DW_AT_decl_line   : (data1) 220
     <e37>   DW_AT_decl_column : (data1) 21
     <e38>   DW_AT_type        : (ref4) <0xe3c>, PyObject, _object
  <1><e3c>: Abbrev Number: 10 (DW_TAG_pointer_type)
     <e3d>   DW_AT_byte_size   : (data1) 8
     <e3e>   DW_AT_type        : (ref4) <0xe42>, PyObject, _object
@@ -1921,45 +1921,45 @@
     <e4c>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><e50>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <e51>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
  <2><e55>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <e56>   DW_AT_type        : (ref4) <0x4f>, int
  <2><e5a>: Abbrev Number: 0
  <1><e5b>: Abbrev Number: 3 (DW_TAG_typedef)
